JPrier/LLMK/inc/system/stm32h723x.h
  #define PERIPH_BASE               (0x40000000UL) /*!< Base address of : AHB/APB Peripherals                                                   */
  #define OCTOSPI1_BASE             (0x90000000UL) /*!< Base address of : OCTOSPI1 memories  accessible over AXI                                 */
  #define OCTOSPI2_BASE             (0x70000000UL) /*!< Base address of : OCTOSPI2 memories  accessible over AXI                                 */
  
  #define FLASH_BANK1_BASE          (0x08000000UL) /*!< Base address of : (up to 1 MB) Flash Bank1 accessible over AXI                          */
  #define FLASH_END                 (0x080FFFFFUL) /*!< FLASH end address                                                                       */
  
  
  /* Legacy define */
  #define FLASH_BASE                FLASH_BANK1_BASE
  
  /*!< Device electronic signature memory map */
  #define UID_BASE                  (0x1FF1E800UL)            /*!< Unique device ID register base address */
  #define FLASHSIZE_BASE            (0x1FF1E880UL)            /*!< FLASH Size register base address */
  
  
  /*!< Peripheral memory map */
  #define D2_APB1PERIPH_BASE        PERIPH_BASE
  #define D2_APB2PERIPH_BASE       (PERIPH_BASE + 0x00010000UL)
  #define D2_AHB1PERIPH_BASE       (PERIPH_BASE + 0x00020000UL)
  #define D2_AHB2PERIPH_BASE       (PERIPH_BASE + 0x08020000UL)
  
  #define D1_APB1PERIPH_BASE       (PERIPH_BASE + 0x10000000UL)
  #define D1_AHB1PERIPH_BASE       (PERIPH_BASE + 0x12000000UL)
  
  #define D3_APB1PERIPH_BASE       (PERIPH_BASE + 0x18000000UL)
  #define D3_AHB1PERIPH_BASE       (PERIPH_BASE + 0x18020000UL)
  
  /*!< Legacy Peripheral memory map */
  #define APB1PERIPH_BASE        PERIPH_BASE
  #define APB2PERIPH_BASE       (PERIPH_BASE + 0x00010000UL)
  #define AHB1PERIPH_BASE       (PERIPH_BASE + 0x00020000UL)
  #define AHB2PERIPH_BASE       (PERIPH_BASE + 0x08000000UL)
  
  
  /*!< D1_AHB1PERIPH peripherals */
  
  #define MDMA_BASE             (D1_AHB1PERIPH_BASE + 0x0000UL)
  #define DMA2D_BASE            (D1_AHB1PERIPH_BASE + 0x1000UL)
  #define FLASH_R_BASE          (D1_AHB1PERIPH_BASE + 0x2000UL)
  #define FMC_R_BASE            (D1_AHB1PERIPH_BASE + 0x4000UL)
  #define OCTOSPI1_R_BASE       (D1_AHB1PERIPH_BASE + 0x5000UL)
  #define DLYB_OCTOSPI1_BASE    (D1_AHB1PERIPH_BASE + 0x6000UL)
  #define SDMMC1_BASE           (D1_AHB1PERIPH_BASE + 0x7000UL)
  #define DLYB_SDMMC1_BASE      (D1_AHB1PERIPH_BASE + 0x8000UL)
  #define RAMECC1_BASE          (D1_AHB1PERIPH_BASE + 0x9000UL)
  #define OCTOSPI2_R_BASE       (D1_AHB1PERIPH_BASE + 0xA000UL)
  #define DLYB_OCTOSPI2_BASE    (D1_AHB1PERIPH_BASE + 0xB000UL)
  #define OCTOSPIM_BASE         (D1_AHB1PERIPH_BASE + 0xB400UL)
  
  /*!< D2_AHB1PERIPH peripherals */
  
  #define DMA1_BASE               (D2_AHB1PERIPH_BASE + 0x0000UL)
  #define DMA2_BASE               (D2_AHB1PERIPH_BASE + 0x0400UL)
  #define DMAMUX1_BASE            (D2_AHB1PERIPH_BASE + 0x0800UL)
  #define ADC1_BASE               (D2_AHB1PERIPH_BASE + 0x2000UL)
  #define ADC2_BASE               (D2_AHB1PERIPH_BASE + 0x2100UL)
  #define ADC12_COMMON_BASE       (D2_AHB1PERIPH_BASE + 0x2300UL)
  #define ETH_BASE                (D2_AHB1PERIPH_BASE + 0x8000UL)
  #define ETH_MAC_BASE            (ETH_BASE)
  
  /*!< USB registers base address */
  #define USB1_OTG_HS_PERIPH_BASE              (0x40040000UL)
  #define USB_OTG_GLOBAL_BASE                  (0x000UL)
  #define USB_OTG_DEVICE_BASE                  (0x800UL)
  #define USB_OTG_IN_ENDPOINT_BASE             (0x900UL)
  #define USB_OTG_OUT_ENDPOINT_BASE            (0xB00UL)
  #define USB_OTG_EP_REG_SIZE                  (0x20UL)
  #define USB_OTG_HOST_BASE                    (0x400UL)
  #define USB_OTG_HOST_PORT_BASE               (0x440UL)
  #define USB_OTG_HOST_CHANNEL_BASE            (0x500UL)
  #define USB_OTG_HOST_CHANNEL_SIZE            (0x20UL)
  #define USB_OTG_PCGCCTL_BASE                 (0xE00UL)
  #define USB_OTG_FIFO_BASE                    (0x1000UL)
  #define USB_OTG_FIFO_SIZE                    (0x1000UL)
  
  /*!< D2_AHB2PERIPH peripherals */
  
  #define DCMI_BASE              (D2_AHB2PERIPH_BASE + 0x0000UL)
  #define PSSI_BASE              (D2_AHB2PERIPH_BASE + 0x0400UL)
  #define RNG_BASE               (D2_AHB2PERIPH_BASE + 0x1800UL)
  #define SDMMC2_BASE            (D2_AHB2PERIPH_BASE + 0x2400UL)
  #define DLYB_SDMMC2_BASE       (D2_AHB2PERIPH_BASE + 0x2800UL)
  #define RAMECC2_BASE           (D2_AHB2PERIPH_BASE + 0x3000UL)
  #define FMAC_BASE              (D2_AHB2PERIPH_BASE + 0x4000UL)
  #define CORDIC_BASE            (D2_AHB2PERIPH_BASE + 0x4400UL)
  
  /*!< D3_AHB1PERIPH peripherals */
  #define GPIOA_BASE            (D3_AHB1PERIPH_BASE + 0x0000UL)
  #define GPIOB_BASE            (D3_AHB1PERIPH_BASE + 0x0400UL)
  #define GPIOC_BASE            (D3_AHB1PERIPH_BASE + 0x0800UL)
  #define GPIOD_BASE            (D3_AHB1PERIPH_BASE + 0x0C00UL)
  #define GPIOE_BASE            (D3_AHB1PERIPH_BASE + 0x1000UL)
  #define GPIOF_BASE            (D3_AHB1PERIPH_BASE + 0x1400UL)
  #define GPIOG_BASE            (D3_AHB1PERIPH_BASE + 0x1800UL)
  #define GPIOH_BASE            (D3_AHB1PERIPH_BASE + 0x1C00UL)
  #define GPIOJ_BASE            (D3_AHB1PERIPH_BASE + 0x2400UL)
  #define GPIOK_BASE            (D3_AHB1PERIPH_BASE + 0x2800UL)
  #define RCC_BASE              (D3_AHB1PERIPH_BASE + 0x4400UL)
  #define PWR_BASE              (D3_AHB1PERIPH_BASE + 0x4800UL)
  #define CRC_BASE              (D3_AHB1PERIPH_BASE + 0x4C00UL)
  #define BDMA_BASE             (D3_AHB1PERIPH_BASE + 0x5400UL)
  #define DMAMUX2_BASE          (D3_AHB1PERIPH_BASE + 0x5800UL)
  #define ADC3_BASE             (D3_AHB1PERIPH_BASE + 0x6000UL)
  #define ADC3_COMMON_BASE      (D3_AHB1PERIPH_BASE + 0x6300UL)
  #define HSEM_BASE             (D3_AHB1PERIPH_BASE + 0x6400UL)
  #define RAMECC3_BASE          (D3_AHB1PERIPH_BASE + 0x7000UL)
  
  /*!< D1_APB1PERIPH peripherals */
  #define LTDC_BASE             (D1_APB1PERIPH_BASE + 0x1000UL)
  #define LTDC_Layer1_BASE      (LTDC_BASE + 0x84UL)
  #define LTDC_Layer2_BASE      (LTDC_BASE + 0x104UL)
  #define WWDG1_BASE            (D1_APB1PERIPH_BASE + 0x3000UL)
  
