JPrier/LLMK/inc/system/stm32h723x.h
  /*!< D2_APB1PERIPH peripherals */
  #define TIM2_BASE             (D2_APB1PERIPH_BASE + 0x0000UL)
  #define TIM3_BASE             (D2_APB1PERIPH_BASE + 0x0400UL)
  #define TIM4_BASE             (D2_APB1PERIPH_BASE + 0x0800UL)
  #define TIM5_BASE             (D2_APB1PERIPH_BASE + 0x0C00UL)
  #define TIM6_BASE             (D2_APB1PERIPH_BASE + 0x1000UL)
  #define TIM7_BASE             (D2_APB1PERIPH_BASE + 0x1400UL)
  #define TIM12_BASE            (D2_APB1PERIPH_BASE + 0x1800UL)
  #define TIM13_BASE            (D2_APB1PERIPH_BASE + 0x1C00UL)
  #define TIM14_BASE            (D2_APB1PERIPH_BASE + 0x2000UL)
  #define LPTIM1_BASE           (D2_APB1PERIPH_BASE + 0x2400UL)
  
  
  #define SPI2_BASE             (D2_APB1PERIPH_BASE + 0x3800UL)
  #define SPI3_BASE             (D2_APB1PERIPH_BASE + 0x3C00UL)
  #define SPDIFRX_BASE          (D2_APB1PERIPH_BASE + 0x4000UL)
  #define USART2_BASE           (D2_APB1PERIPH_BASE + 0x4400UL)
  #define USART3_BASE           (D2_APB1PERIPH_BASE + 0x4800UL)
  #define UART4_BASE            (D2_APB1PERIPH_BASE + 0x4C00UL)
  #define UART5_BASE            (D2_APB1PERIPH_BASE + 0x5000UL)
  #define I2C1_BASE             (D2_APB1PERIPH_BASE + 0x5400UL)
  #define I2C2_BASE             (D2_APB1PERIPH_BASE + 0x5800UL)
  #define I2C3_BASE             (D2_APB1PERIPH_BASE + 0x5C00UL)
  #define I2C5_BASE             (D2_APB1PERIPH_BASE + 0x6400UL)
  #define CEC_BASE              (D2_APB1PERIPH_BASE + 0x6C00UL)
  #define DAC1_BASE             (D2_APB1PERIPH_BASE + 0x7400UL)
  #define UART7_BASE            (D2_APB1PERIPH_BASE + 0x7800UL)
  #define UART8_BASE            (D2_APB1PERIPH_BASE + 0x7C00UL)
  #define CRS_BASE              (D2_APB1PERIPH_BASE + 0x8400UL)
  #define SWPMI1_BASE           (D2_APB1PERIPH_BASE + 0x8800UL)
  #define OPAMP_BASE            (D2_APB1PERIPH_BASE + 0x9000UL)
  #define OPAMP1_BASE           (D2_APB1PERIPH_BASE + 0x9000UL)
  #define OPAMP2_BASE           (D2_APB1PERIPH_BASE + 0x9010UL)
  #define MDIOS_BASE            (D2_APB1PERIPH_BASE + 0x9400UL)
  #define FDCAN1_BASE           (D2_APB1PERIPH_BASE + 0xA000UL)
  #define FDCAN2_BASE           (D2_APB1PERIPH_BASE + 0xA400UL)
  #define FDCAN_CCU_BASE        (D2_APB1PERIPH_BASE + 0xA800UL)
  #define SRAMCAN_BASE          (D2_APB1PERIPH_BASE + 0xAC00UL)
  #define FDCAN3_BASE           (D2_APB1PERIPH_BASE + 0xD400UL)
  #define TIM23_BASE            (D2_APB1PERIPH_BASE + 0xE000UL)
  #define TIM24_BASE            (D2_APB1PERIPH_BASE + 0xE400UL)
  
  /*!< D2_APB2PERIPH peripherals */
  
  #define TIM1_BASE             (D2_APB2PERIPH_BASE + 0x0000UL)
  #define TIM8_BASE             (D2_APB2PERIPH_BASE + 0x0400UL)
  #define USART1_BASE           (D2_APB2PERIPH_BASE + 0x1000UL)
  #define USART6_BASE           (D2_APB2PERIPH_BASE + 0x1400UL)
  #define UART9_BASE            (D2_APB2PERIPH_BASE + 0x1800UL)
  #define USART10_BASE          (D2_APB2PERIPH_BASE + 0x1C00UL)
  #define SPI1_BASE             (D2_APB2PERIPH_BASE + 0x3000UL)
  #define SPI4_BASE             (D2_APB2PERIPH_BASE + 0x3400UL)
  #define TIM15_BASE            (D2_APB2PERIPH_BASE + 0x4000UL)
  #define TIM16_BASE            (D2_APB2PERIPH_BASE + 0x4400UL)
  #define TIM17_BASE            (D2_APB2PERIPH_BASE + 0x4800UL)
  #define SPI5_BASE             (D2_APB2PERIPH_BASE + 0x5000UL)
  #define SAI1_BASE             (D2_APB2PERIPH_BASE + 0x5800UL)
  #define SAI1_Block_A_BASE     (SAI1_BASE + 0x004UL)
  #define SAI1_Block_B_BASE     (SAI1_BASE + 0x024UL)
  #define DFSDM1_BASE           (D2_APB2PERIPH_BASE + 0x7800UL)
  #define DFSDM1_Channel0_BASE  (DFSDM1_BASE + 0x00UL)
  #define DFSDM1_Channel1_BASE  (DFSDM1_BASE + 0x20UL)
  #define DFSDM1_Channel2_BASE  (DFSDM1_BASE + 0x40UL)
  #define DFSDM1_Channel3_BASE  (DFSDM1_BASE + 0x60UL)
  #define DFSDM1_Channel4_BASE  (DFSDM1_BASE + 0x80UL)
  #define DFSDM1_Channel5_BASE  (DFSDM1_BASE + 0xA0UL)
  #define DFSDM1_Channel6_BASE  (DFSDM1_BASE + 0xC0UL)
  #define DFSDM1_Channel7_BASE  (DFSDM1_BASE + 0xE0UL)
  #define DFSDM1_Filter0_BASE   (DFSDM1_BASE + 0x100UL)
  #define DFSDM1_Filter1_BASE   (DFSDM1_BASE + 0x180UL)
  #define DFSDM1_Filter2_BASE   (DFSDM1_BASE + 0x200UL)
  #define DFSDM1_Filter3_BASE   (DFSDM1_BASE + 0x280UL)
  
  
  /*!< D3_APB1PERIPH peripherals */
  #define EXTI_BASE             (D3_APB1PERIPH_BASE + 0x0000UL)
  #define EXTI_D1_BASE          (EXTI_BASE + 0x0080UL)
  #define EXTI_D2_BASE          (EXTI_BASE + 0x00C0UL)
  #define SYSCFG_BASE           (D3_APB1PERIPH_BASE + 0x0400UL)
  #define LPUART1_BASE          (D3_APB1PERIPH_BASE + 0x0C00UL)
  #define SPI6_BASE             (D3_APB1PERIPH_BASE + 0x1400UL)
  #define I2C4_BASE             (D3_APB1PERIPH_BASE + 0x1C00UL)
  #define LPTIM2_BASE           (D3_APB1PERIPH_BASE + 0x2400UL)
  #define LPTIM3_BASE           (D3_APB1PERIPH_BASE + 0x2800UL)
  #define LPTIM4_BASE           (D3_APB1PERIPH_BASE + 0x2C00UL)
  #define LPTIM5_BASE           (D3_APB1PERIPH_BASE + 0x3000UL)
  #define COMP12_BASE           (D3_APB1PERIPH_BASE + 0x3800UL)
  #define COMP1_BASE            (COMP12_BASE + 0x0CUL)
  #define COMP2_BASE            (COMP12_BASE + 0x10UL)
  #define VREFBUF_BASE          (D3_APB1PERIPH_BASE + 0x3C00UL)
  #define RTC_BASE              (D3_APB1PERIPH_BASE + 0x4000UL)
  #define IWDG1_BASE            (D3_APB1PERIPH_BASE + 0x4800UL)
  
  
  #define SAI4_BASE             (D3_APB1PERIPH_BASE + 0x5400UL)
  #define SAI4_Block_A_BASE     (SAI4_BASE + 0x004UL)
  #define SAI4_Block_B_BASE     (SAI4_BASE + 0x024UL)
  
  #define DTS_BASE              (D3_APB1PERIPH_BASE + 0x6800UL)
  
  
  
  #define BDMA_Channel0_BASE    (BDMA_BASE + 0x0008UL)
  #define BDMA_Channel1_BASE    (BDMA_BASE + 0x001CUL)
  #define BDMA_Channel2_BASE    (BDMA_BASE + 0x0030UL)
  #define BDMA_Channel3_BASE    (BDMA_BASE + 0x0044UL)
  #define BDMA_Channel4_BASE    (BDMA_BASE + 0x0058UL)
  #define BDMA_Channel5_BASE    (BDMA_BASE + 0x006CUL)
  #define BDMA_Channel6_BASE    (BDMA_BASE + 0x0080UL)
  #define BDMA_Channel7_BASE    (BDMA_BASE + 0x0094UL)
  
  #define DMAMUX2_Channel0_BASE    (DMAMUX2_BASE)
  #define DMAMUX2_Channel1_BASE    (DMAMUX2_BASE + 0x0004UL)
  #define DMAMUX2_Channel2_BASE    (DMAMUX2_BASE + 0x0008UL)
  #define DMAMUX2_Channel3_BASE    (DMAMUX2_BASE + 0x000CUL)
  #define DMAMUX2_Channel4_BASE    (DMAMUX2_BASE + 0x0010UL)
  #define DMAMUX2_Channel5_BASE    (DMAMUX2_BASE + 0x0014UL)
  #define DMAMUX2_Channel6_BASE    (DMAMUX2_BASE + 0x0018UL)
  #define DMAMUX2_Channel7_BASE    (DMAMUX2_BASE + 0x001CUL)
  
  #define DMAMUX2_RequestGenerator0_BASE  (DMAMUX2_BASE + 0x0100UL)
  #define DMAMUX2_RequestGenerator1_BASE  (DMAMUX2_BASE + 0x0104UL)
  #define DMAMUX2_RequestGenerator2_BASE  (DMAMUX2_BASE + 0x0108UL)
  #define DMAMUX2_RequestGenerator3_BASE  (DMAMUX2_BASE + 0x010CUL)
  #define DMAMUX2_RequestGenerator4_BASE  (DMAMUX2_BASE + 0x0110UL)
  #define DMAMUX2_RequestGenerator5_BASE  (DMAMUX2_BASE + 0x0114UL)
  #define DMAMUX2_RequestGenerator6_BASE  (DMAMUX2_BASE + 0x0118UL)
  #define DMAMUX2_RequestGenerator7_BASE  (DMAMUX2_BASE + 0x011CUL)
  
  #define DMAMUX2_ChannelStatus_BASE      (DMAMUX2_BASE + 0x0080UL)
  #define DMAMUX2_RequestGenStatus_BASE   (DMAMUX2_BASE + 0x0140UL)
  
