JPrier/LLMK/inc/system/stm32h723x.h
  #define DMA1_Stream0_BASE     (DMA1_BASE + 0x010UL)
  #define DMA1_Stream1_BASE     (DMA1_BASE + 0x028UL)
  #define DMA1_Stream2_BASE     (DMA1_BASE + 0x040UL)
  #define DMA1_Stream3_BASE     (DMA1_BASE + 0x058UL)
  #define DMA1_Stream4_BASE     (DMA1_BASE + 0x070UL)
  #define DMA1_Stream5_BASE     (DMA1_BASE + 0x088UL)
  #define DMA1_Stream6_BASE     (DMA1_BASE + 0x0A0UL)
  #define DMA1_Stream7_BASE     (DMA1_BASE + 0x0B8UL)
  
  #define DMA2_Stream0_BASE     (DMA2_BASE + 0x010UL)
  #define DMA2_Stream1_BASE     (DMA2_BASE + 0x028UL)
  #define DMA2_Stream2_BASE     (DMA2_BASE + 0x040UL)
  #define DMA2_Stream3_BASE     (DMA2_BASE + 0x058UL)
  #define DMA2_Stream4_BASE     (DMA2_BASE + 0x070UL)
  #define DMA2_Stream5_BASE     (DMA2_BASE + 0x088UL)
  #define DMA2_Stream6_BASE     (DMA2_BASE + 0x0A0UL)
  #define DMA2_Stream7_BASE     (DMA2_BASE + 0x0B8UL)
  
  #define DMAMUX1_Channel0_BASE    (DMAMUX1_BASE)
  #define DMAMUX1_Channel1_BASE    (DMAMUX1_BASE + 0x0004UL)
  #define DMAMUX1_Channel2_BASE    (DMAMUX1_BASE + 0x0008UL)
  #define DMAMUX1_Channel3_BASE    (DMAMUX1_BASE + 0x000CUL)
  #define DMAMUX1_Channel4_BASE    (DMAMUX1_BASE + 0x0010UL)
  #define DMAMUX1_Channel5_BASE    (DMAMUX1_BASE + 0x0014UL)
  #define DMAMUX1_Channel6_BASE    (DMAMUX1_BASE + 0x0018UL)
  #define DMAMUX1_Channel7_BASE    (DMAMUX1_BASE + 0x001CUL)
  #define DMAMUX1_Channel8_BASE    (DMAMUX1_BASE + 0x0020UL)
  #define DMAMUX1_Channel9_BASE    (DMAMUX1_BASE + 0x0024UL)
  #define DMAMUX1_Channel10_BASE   (DMAMUX1_BASE + 0x0028UL)
  #define DMAMUX1_Channel11_BASE   (DMAMUX1_BASE + 0x002CUL)
  #define DMAMUX1_Channel12_BASE   (DMAMUX1_BASE + 0x0030UL)
  #define DMAMUX1_Channel13_BASE   (DMAMUX1_BASE + 0x0034UL)
  #define DMAMUX1_Channel14_BASE   (DMAMUX1_BASE + 0x0038UL)
  #define DMAMUX1_Channel15_BASE   (DMAMUX1_BASE + 0x003CUL)
  
  #define DMAMUX1_RequestGenerator0_BASE  (DMAMUX1_BASE + 0x0100UL)
  #define DMAMUX1_RequestGenerator1_BASE  (DMAMUX1_BASE + 0x0104UL)
  #define DMAMUX1_RequestGenerator2_BASE  (DMAMUX1_BASE + 0x0108UL)
  #define DMAMUX1_RequestGenerator3_BASE  (DMAMUX1_BASE + 0x010CUL)
  #define DMAMUX1_RequestGenerator4_BASE  (DMAMUX1_BASE + 0x0110UL)
  #define DMAMUX1_RequestGenerator5_BASE  (DMAMUX1_BASE + 0x0114UL)
  #define DMAMUX1_RequestGenerator6_BASE  (DMAMUX1_BASE + 0x0118UL)
  #define DMAMUX1_RequestGenerator7_BASE  (DMAMUX1_BASE + 0x011CUL)
  
  #define DMAMUX1_ChannelStatus_BASE      (DMAMUX1_BASE + 0x0080UL)
  #define DMAMUX1_RequestGenStatus_BASE   (DMAMUX1_BASE + 0x0140UL)
  
  /*!< FMC Banks registers base  address */
  #define FMC_Bank1_R_BASE      (FMC_R_BASE + 0x0000UL)
  #define FMC_Bank1E_R_BASE     (FMC_R_BASE + 0x0104UL)
  #define FMC_Bank2_R_BASE      (FMC_R_BASE + 0x0060UL)
  #define FMC_Bank3_R_BASE      (FMC_R_BASE + 0x0080UL)
  #define FMC_Bank5_6_R_BASE    (FMC_R_BASE + 0x0140UL)
  
  /* Debug MCU registers base address */
  #define DBGMCU_BASE           (0x5C001000UL)
  
  #define MDMA_Channel0_BASE    (MDMA_BASE + 0x00000040UL)
  #define MDMA_Channel1_BASE    (MDMA_BASE + 0x00000080UL)
  #define MDMA_Channel2_BASE    (MDMA_BASE + 0x000000C0UL)
  #define MDMA_Channel3_BASE    (MDMA_BASE + 0x00000100UL)
  #define MDMA_Channel4_BASE    (MDMA_BASE + 0x00000140UL)
  #define MDMA_Channel5_BASE    (MDMA_BASE + 0x00000180UL)
  #define MDMA_Channel6_BASE    (MDMA_BASE + 0x000001C0UL)
  #define MDMA_Channel7_BASE    (MDMA_BASE + 0x00000200UL)
  #define MDMA_Channel8_BASE    (MDMA_BASE + 0x00000240UL)
  #define MDMA_Channel9_BASE    (MDMA_BASE + 0x00000280UL)
  #define MDMA_Channel10_BASE   (MDMA_BASE + 0x000002C0UL)
  #define MDMA_Channel11_BASE   (MDMA_BASE + 0x00000300UL)
  #define MDMA_Channel12_BASE   (MDMA_BASE + 0x00000340UL)
  #define MDMA_Channel13_BASE   (MDMA_BASE + 0x00000380UL)
  #define MDMA_Channel14_BASE   (MDMA_BASE + 0x000003C0UL)
  #define MDMA_Channel15_BASE   (MDMA_BASE + 0x00000400UL)
  
  #define RAMECC1_Monitor1_BASE (RAMECC1_BASE + 0x20UL)
  #define RAMECC1_Monitor2_BASE (RAMECC1_BASE + 0x40UL)
  #define RAMECC1_Monitor3_BASE (RAMECC1_BASE + 0x60UL)
  #define RAMECC1_Monitor4_BASE (RAMECC1_BASE + 0x80UL)
  #define RAMECC1_Monitor5_BASE (RAMECC1_BASE + 0xA0UL)
  #define RAMECC1_Monitor6_BASE (RAMECC1_BASE + 0xC0UL)
  
  #define RAMECC2_Monitor1_BASE (RAMECC2_BASE + 0x20UL)
  #define RAMECC2_Monitor2_BASE (RAMECC2_BASE + 0x40UL)
  #define RAMECC2_Monitor3_BASE (RAMECC2_BASE + 0x60UL)
  
  #define RAMECC3_Monitor1_BASE (RAMECC3_BASE + 0x20UL)
  #define RAMECC3_Monitor2_BASE (RAMECC3_BASE + 0x40UL)
  
  
  
  #define GPV_BASE       (PERIPH_BASE + 0x11000000UL)   /*!<  GPV_BASE       (PERIPH_BASE + 0x11000000UL)                    */
  
  /**
    * @}
    */
  
  /** @addtogroup Peripheral_declaration
    * @{
    */
  #define TIM2                ((TIM_TypeDef *) TIM2_BASE)
  #define TIM3                ((TIM_TypeDef *) TIM3_BASE)
  #define TIM4                ((TIM_TypeDef *) TIM4_BASE)
  #define TIM5                ((TIM_TypeDef *) TIM5_BASE)
  #define TIM6                ((TIM_TypeDef *) TIM6_BASE)
  #define TIM7                ((TIM_TypeDef *) TIM7_BASE)
  #define TIM13               ((TIM_TypeDef *) TIM13_BASE)
  #define TIM14               ((TIM_TypeDef *) TIM14_BASE)
  #define VREFBUF             ((VREFBUF_TypeDef *) VREFBUF_BASE)
  #define RTC                 ((RTC_TypeDef *) RTC_BASE)
  #define WWDG1               ((WWDG_TypeDef *) WWDG1_BASE)
  
  
  #define IWDG1               ((IWDG_TypeDef *) IWDG1_BASE)
  #define SPI2                ((SPI_TypeDef *) SPI2_BASE)
  #define SPI3                ((SPI_TypeDef *) SPI3_BASE)
  #define SPI4                ((SPI_TypeDef *) SPI4_BASE)
  #define SPI5                ((SPI_TypeDef *) SPI5_BASE)
  #define SPI6                ((SPI_TypeDef *) SPI6_BASE)
  #define USART2              ((USART_TypeDef *) USART2_BASE)
  #define USART3              ((USART_TypeDef *) USART3_BASE)
  #define USART6              ((USART_TypeDef *) USART6_BASE)
  #define USART10             ((USART_TypeDef *) USART10_BASE)
  #define UART7               ((USART_TypeDef *) UART7_BASE)
  #define UART8               ((USART_TypeDef *) UART8_BASE)
  #define UART9               ((USART_TypeDef *) UART9_BASE)
  #define CRS                 ((CRS_TypeDef *) CRS_BASE)
  #define UART4               ((USART_TypeDef *) UART4_BASE)
  #define UART5               ((USART_TypeDef *) UART5_BASE)
  #define I2C1                ((I2C_TypeDef *) I2C1_BASE)
  #define I2C2                ((I2C_TypeDef *) I2C2_BASE)
  #define I2C3                ((I2C_TypeDef *) I2C3_BASE)
  #define I2C4                ((I2C_TypeDef *) I2C4_BASE)
  #define I2C5                ((I2C_TypeDef *) I2C5_BASE)
  #define FDCAN1              ((FDCAN_GlobalTypeDef *) FDCAN1_BASE)
  #define FDCAN2              ((FDCAN_GlobalTypeDef *) FDCAN2_BASE)
  #define FDCAN_CCU           ((FDCAN_ClockCalibrationUnit_TypeDef *) FDCAN_CCU_BASE)
  #define FDCAN3              ((FDCAN_GlobalTypeDef *) FDCAN3_BASE)
  #define TIM23               ((TIM_TypeDef *) TIM23_BASE)
  #define TIM24               ((TIM_TypeDef *) TIM24_BASE)
  #define CEC                 ((CEC_TypeDef *) CEC_BASE)
  #define LPTIM1              ((LPTIM_TypeDef *) LPTIM1_BASE)
  #define PWR                 ((PWR_TypeDef *) PWR_BASE)
  #define DAC1                ((DAC_TypeDef *) DAC1_BASE)
  #define LPUART1             ((USART_TypeDef *) LPUART1_BASE)
  #define SWPMI1              ((SWPMI_TypeDef *) SWPMI1_BASE)
  #define LPTIM2              ((LPTIM_TypeDef *) LPTIM2_BASE)
  #define LPTIM3              ((LPTIM_TypeDef *) LPTIM3_BASE)
  #define DTS                 ((DTS_TypeDef *) DTS_BASE)
  #define LPTIM4              ((LPTIM_TypeDef *) LPTIM4_BASE)
  #define LPTIM5              ((LPTIM_TypeDef *) LPTIM5_BASE)
  
