JPrier/LLMK/inc/system/stm32h723x.h
  #define SYSCFG              ((SYSCFG_TypeDef *) SYSCFG_BASE)
  #define COMP12              ((COMPOPT_TypeDef *) COMP12_BASE)
  #define COMP1               ((COMP_TypeDef *) COMP1_BASE)
  #define COMP2               ((COMP_TypeDef *) COMP2_BASE)
  #define COMP12_COMMON       ((COMP_Common_TypeDef *) COMP2_BASE)
  #define OPAMP               ((OPAMP_TypeDef *) OPAMP_BASE)
  #define OPAMP1              ((OPAMP_TypeDef *) OPAMP1_BASE)
  #define OPAMP2              ((OPAMP_TypeDef *) OPAMP2_BASE)
  
  
  #define EXTI                ((EXTI_TypeDef *) EXTI_BASE)
  #define EXTI_D1             ((EXTI_Core_TypeDef *) EXTI_D1_BASE)
  #define EXTI_D2             ((EXTI_Core_TypeDef *) EXTI_D2_BASE)
  #define TIM1                ((TIM_TypeDef *) TIM1_BASE)
  #define SPI1                ((SPI_TypeDef *) SPI1_BASE)
  #define TIM8                ((TIM_TypeDef *) TIM8_BASE)
  #define USART1              ((USART_TypeDef *) USART1_BASE)
  #define TIM12               ((TIM_TypeDef *) TIM12_BASE)
  #define TIM15               ((TIM_TypeDef *) TIM15_BASE)
  #define TIM16               ((TIM_TypeDef *) TIM16_BASE)
  #define TIM17               ((TIM_TypeDef *) TIM17_BASE)
  #define SAI1                ((SAI_TypeDef *) SAI1_BASE)
  #define SAI1_Block_A        ((SAI_Block_TypeDef *)SAI1_Block_A_BASE)
  #define SAI1_Block_B        ((SAI_Block_TypeDef *)SAI1_Block_B_BASE)
  #define SAI4                ((SAI_TypeDef *) SAI4_BASE)
  #define SAI4_Block_A        ((SAI_Block_TypeDef *)SAI4_Block_A_BASE)
  #define SAI4_Block_B        ((SAI_Block_TypeDef *)SAI4_Block_B_BASE)
  
  #define SPDIFRX             ((SPDIFRX_TypeDef *) SPDIFRX_BASE)
  #define DFSDM1_Channel0     ((DFSDM_Channel_TypeDef *) DFSDM1_Channel0_BASE)
  #define DFSDM1_Channel1     ((DFSDM_Channel_TypeDef *) DFSDM1_Channel1_BASE)
  #define DFSDM1_Channel2     ((DFSDM_Channel_TypeDef *) DFSDM1_Channel2_BASE)
  #define DFSDM1_Channel3     ((DFSDM_Channel_TypeDef *) DFSDM1_Channel3_BASE)
  #define DFSDM1_Channel4     ((DFSDM_Channel_TypeDef *) DFSDM1_Channel4_BASE)
  #define DFSDM1_Channel5     ((DFSDM_Channel_TypeDef *) DFSDM1_Channel5_BASE)
  #define DFSDM1_Channel6     ((DFSDM_Channel_TypeDef *) DFSDM1_Channel6_BASE)
  #define DFSDM1_Channel7     ((DFSDM_Channel_TypeDef *) DFSDM1_Channel7_BASE)
  #define DFSDM1_Filter0      ((DFSDM_Filter_TypeDef *) DFSDM1_Filter0_BASE)
  #define DFSDM1_Filter1      ((DFSDM_Filter_TypeDef *) DFSDM1_Filter1_BASE)
  #define DFSDM1_Filter2      ((DFSDM_Filter_TypeDef *) DFSDM1_Filter2_BASE)
  #define DFSDM1_Filter3      ((DFSDM_Filter_TypeDef *) DFSDM1_Filter3_BASE)
  #define DMA2D               ((DMA2D_TypeDef *) DMA2D_BASE)
  #define DCMI                ((DCMI_TypeDef *) DCMI_BASE)
  #define PSSI                ((PSSI_TypeDef *) PSSI_BASE)
  #define RCC                 ((RCC_TypeDef *) RCC_BASE)
  #define FLASH               ((FLASH_TypeDef *) FLASH_R_BASE)
  #define CRC                 ((CRC_TypeDef *) CRC_BASE)
  
  #define GPIOA               ((GPIO_TypeDef *) GPIOA_BASE)
  #define GPIOB               ((GPIO_TypeDef *) GPIOB_BASE)
  #define GPIOC               ((GPIO_TypeDef *) GPIOC_BASE)
  #define GPIOD               ((GPIO_TypeDef *) GPIOD_BASE)
  #define GPIOE               ((GPIO_TypeDef *) GPIOE_BASE)
  #define GPIOF               ((GPIO_TypeDef *) GPIOF_BASE)
  #define GPIOG               ((GPIO_TypeDef *) GPIOG_BASE)
  #define GPIOH               ((GPIO_TypeDef *) GPIOH_BASE)
  #define GPIOJ               ((GPIO_TypeDef *) GPIOJ_BASE)
  #define GPIOK               ((GPIO_TypeDef *) GPIOK_BASE)
  
  #define ADC1                ((ADC_TypeDef *) ADC1_BASE)
  #define ADC2                ((ADC_TypeDef *) ADC2_BASE)
  #define ADC3                ((ADC_TypeDef *) ADC3_BASE)
  #define ADC3_COMMON         ((ADC_Common_TypeDef *) ADC3_COMMON_BASE)
  #define ADC12_COMMON        ((ADC_Common_TypeDef *) ADC12_COMMON_BASE)
  
  #define RNG                 ((RNG_TypeDef *) RNG_BASE)
  #define SDMMC2              ((SDMMC_TypeDef *) SDMMC2_BASE)
  #define DLYB_SDMMC2         ((DLYB_TypeDef *) DLYB_SDMMC2_BASE)
  #define FMAC                ((FMAC_TypeDef *) FMAC_BASE)
  #define CORDIC              ((CORDIC_TypeDef *) CORDIC_BASE)
  
  #define BDMA                ((BDMA_TypeDef *) BDMA_BASE)
  #define BDMA_Channel0       ((BDMA_Channel_TypeDef *) BDMA_Channel0_BASE)
  #define BDMA_Channel1       ((BDMA_Channel_TypeDef *) BDMA_Channel1_BASE)
  #define BDMA_Channel2       ((BDMA_Channel_TypeDef *) BDMA_Channel2_BASE)
  #define BDMA_Channel3       ((BDMA_Channel_TypeDef *) BDMA_Channel3_BASE)
  #define BDMA_Channel4       ((BDMA_Channel_TypeDef *) BDMA_Channel4_BASE)
  #define BDMA_Channel5       ((BDMA_Channel_TypeDef *) BDMA_Channel5_BASE)
  #define BDMA_Channel6       ((BDMA_Channel_TypeDef *) BDMA_Channel6_BASE)
  #define BDMA_Channel7       ((BDMA_Channel_TypeDef *) BDMA_Channel7_BASE)
  
  #define RAMECC1              ((RAMECC_TypeDef *)RAMECC1_BASE)
  #define RAMECC1_Monitor1     ((RAMECC_MonitorTypeDef *)RAMECC1_Monitor1_BASE)
  #define RAMECC1_Monitor2     ((RAMECC_MonitorTypeDef *)RAMECC1_Monitor2_BASE)
  #define RAMECC1_Monitor3     ((RAMECC_MonitorTypeDef *)RAMECC1_Monitor3_BASE)
  #define RAMECC1_Monitor4     ((RAMECC_MonitorTypeDef *)RAMECC1_Monitor4_BASE)
  #define RAMECC1_Monitor5     ((RAMECC_MonitorTypeDef *)RAMECC1_Monitor5_BASE)
  #define RAMECC1_Monitor6     ((RAMECC_MonitorTypeDef *)RAMECC1_Monitor6_BASE)
  
  #define RAMECC2              ((RAMECC_TypeDef *)RAMECC2_BASE)
  #define RAMECC2_Monitor1     ((RAMECC_MonitorTypeDef *)RAMECC2_Monitor1_BASE)
  #define RAMECC2_Monitor2     ((RAMECC_MonitorTypeDef *)RAMECC2_Monitor2_BASE)
  #define RAMECC2_Monitor3     ((RAMECC_MonitorTypeDef *)RAMECC2_Monitor3_BASE)
  
  #define RAMECC3              ((RAMECC_TypeDef *)RAMECC3_BASE)
  #define RAMECC3_Monitor1     ((RAMECC_MonitorTypeDef *)RAMECC3_Monitor1_BASE)
  #define RAMECC3_Monitor2     ((RAMECC_MonitorTypeDef *)RAMECC3_Monitor2_BASE)
  
  #define DMAMUX2                ((DMAMUX_Channel_TypeDef *) DMAMUX2_BASE)
  #define DMAMUX2_Channel0       ((DMAMUX_Channel_TypeDef *) DMAMUX2_Channel0_BASE)
  #define DMAMUX2_Channel1       ((DMAMUX_Channel_TypeDef *) DMAMUX2_Channel1_BASE)
  #define DMAMUX2_Channel2       ((DMAMUX_Channel_TypeDef *) DMAMUX2_Channel2_BASE)
  #define DMAMUX2_Channel3       ((DMAMUX_Channel_TypeDef *) DMAMUX2_Channel3_BASE)
  #define DMAMUX2_Channel4       ((DMAMUX_Channel_TypeDef *) DMAMUX2_Channel4_BASE)
  #define DMAMUX2_Channel5       ((DMAMUX_Channel_TypeDef *) DMAMUX2_Channel5_BASE)
  #define DMAMUX2_Channel6       ((DMAMUX_Channel_TypeDef *) DMAMUX2_Channel6_BASE)
  #define DMAMUX2_Channel7       ((DMAMUX_Channel_TypeDef *) DMAMUX2_Channel7_BASE)
  
  
  #define DMAMUX2_RequestGenerator0  ((DMAMUX_RequestGen_TypeDef *) DMAMUX2_RequestGenerator0_BASE)
  #define DMAMUX2_RequestGenerator1  ((DMAMUX_RequestGen_TypeDef *) DMAMUX2_RequestGenerator1_BASE)
  #define DMAMUX2_RequestGenerator2  ((DMAMUX_RequestGen_TypeDef *) DMAMUX2_RequestGenerator2_BASE)
  #define DMAMUX2_RequestGenerator3  ((DMAMUX_RequestGen_TypeDef *) DMAMUX2_RequestGenerator3_BASE)
  #define DMAMUX2_RequestGenerator4  ((DMAMUX_RequestGen_TypeDef *) DMAMUX2_RequestGenerator4_BASE)
  #define DMAMUX2_RequestGenerator5  ((DMAMUX_RequestGen_TypeDef *) DMAMUX2_RequestGenerator5_BASE)
  #define DMAMUX2_RequestGenerator6  ((DMAMUX_RequestGen_TypeDef *) DMAMUX2_RequestGenerator6_BASE)
  #define DMAMUX2_RequestGenerator7  ((DMAMUX_RequestGen_TypeDef *) DMAMUX2_RequestGenerator7_BASE)
  
  #define DMAMUX2_ChannelStatus      ((DMAMUX_ChannelStatus_TypeDef *) DMAMUX2_ChannelStatus_BASE)
  #define DMAMUX2_RequestGenStatus   ((DMAMUX_RequestGenStatus_TypeDef *) DMAMUX2_RequestGenStatus_BASE)
  
