JPrier/LLMK/inc/system/stm32h723x.h
  /******************  Bit definition for I2C_PECR register  *********************/
  #define I2C_PECR_PEC_Pos             (0U)
  #define I2C_PECR_PEC_Msk             (0xFFUL << I2C_PECR_PEC_Pos)              /*!< 0x000000FF */
  #define I2C_PECR_PEC                 I2C_PECR_PEC_Msk                          /*!< PEC register */
  
  /******************  Bit definition for I2C_RXDR register  *********************/
  #define I2C_RXDR_RXDATA_Pos          (0U)
  #define I2C_RXDR_RXDATA_Msk          (0xFFUL << I2C_RXDR_RXDATA_Pos)           /*!< 0x000000FF */
  #define I2C_RXDR_RXDATA              I2C_RXDR_RXDATA_Msk                       /*!< 8-bit receive data */
  
  /******************  Bit definition for I2C_TXDR register  *********************/
  #define I2C_TXDR_TXDATA_Pos          (0U)
  #define I2C_TXDR_TXDATA_Msk          (0xFFUL << I2C_TXDR_TXDATA_Pos)           /*!< 0x000000FF */
  #define I2C_TXDR_TXDATA              I2C_TXDR_TXDATA_Msk                       /*!< 8-bit transmit data */
  
  /******************************************************************************/
  /*                                                                            */
  /*                           Independent WATCHDOG                             */
  /*                                                                            */
  /******************************************************************************/
  /*******************  Bit definition for IWDG_KR register  ********************/
  #define IWDG_KR_KEY_Pos      (0U)
  #define IWDG_KR_KEY_Msk      (0xFFFFUL << IWDG_KR_KEY_Pos)                     /*!< 0x0000FFFF */
  #define IWDG_KR_KEY          IWDG_KR_KEY_Msk                                   /*!<Key value (write only, read 0000h)  */
  
  /*******************  Bit definition for IWDG_PR register  ********************/
  #define IWDG_PR_PR_Pos       (0U)
  #define IWDG_PR_PR_Msk       (0x7UL << IWDG_PR_PR_Pos)                         /*!< 0x00000007 */
  #define IWDG_PR_PR           IWDG_PR_PR_Msk                                    /*!<PR[2:0] (Prescaler divider)         */
  #define IWDG_PR_PR_0         (0x1UL << IWDG_PR_PR_Pos)                          /*!< 0x00000001 */
  #define IWDG_PR_PR_1         (0x2UL << IWDG_PR_PR_Pos)                          /*!< 0x00000002 */
  #define IWDG_PR_PR_2         (0x4UL << IWDG_PR_PR_Pos)                          /*!< 0x00000004 */
  
  /*******************  Bit definition for IWDG_RLR register  *******************/
  #define IWDG_RLR_RL_Pos      (0U)
  #define IWDG_RLR_RL_Msk      (0xFFFUL << IWDG_RLR_RL_Pos)                      /*!< 0x00000FFF */
  #define IWDG_RLR_RL          IWDG_RLR_RL_Msk                                   /*!<Watchdog counter reload value        */
  
  /*******************  Bit definition for IWDG_SR register  ********************/
  #define IWDG_SR_PVU_Pos      (0U)
  #define IWDG_SR_PVU_Msk      (0x1UL << IWDG_SR_PVU_Pos)                        /*!< 0x00000001 */
  #define IWDG_SR_PVU          IWDG_SR_PVU_Msk                                   /*!< Watchdog prescaler value update */
  #define IWDG_SR_RVU_Pos      (1U)
  #define IWDG_SR_RVU_Msk      (0x1UL << IWDG_SR_RVU_Pos)                        /*!< 0x00000002 */
  #define IWDG_SR_RVU          IWDG_SR_RVU_Msk                                   /*!< Watchdog counter reload value update */
  #define IWDG_SR_WVU_Pos      (2U)
  #define IWDG_SR_WVU_Msk      (0x1UL << IWDG_SR_WVU_Pos)                        /*!< 0x00000004 */
  #define IWDG_SR_WVU          IWDG_SR_WVU_Msk                                   /*!< Watchdog counter window value update */
  
  /*******************  Bit definition for IWDG_KR register  ********************/
  #define IWDG_WINR_WIN_Pos    (0U)
  #define IWDG_WINR_WIN_Msk    (0xFFFUL << IWDG_WINR_WIN_Pos)                    /*!< 0x00000FFF */
  #define IWDG_WINR_WIN        IWDG_WINR_WIN_Msk                                 /*!< Watchdog counter window value */
  
  /******************************************************************************/
  /*                                                                            */
  /*                      LCD-TFT Display Controller (LTDC)                     */
  /*                                                                            */
  /******************************************************************************/
  
  /********************  Bit definition for LTDC_SSCR register  *****************/
  
  #define LTDC_SSCR_VSH_Pos            (0U)
  #define LTDC_SSCR_VSH_Msk            (0x7FFUL << LTDC_SSCR_VSH_Pos)            /*!< 0x000007FF */
  #define LTDC_SSCR_VSH                LTDC_SSCR_VSH_Msk                         /*!< Vertical Synchronization Height  */
  #define LTDC_SSCR_HSW_Pos            (16U)
  #define LTDC_SSCR_HSW_Msk            (0xFFFUL << LTDC_SSCR_HSW_Pos)            /*!< 0x0FFF0000 */
  #define LTDC_SSCR_HSW                LTDC_SSCR_HSW_Msk                         /*!< Horizontal Synchronization Width */
  
  /********************  Bit definition for LTDC_BPCR register  *****************/
  
  #define LTDC_BPCR_AVBP_Pos           (0U)
  #define LTDC_BPCR_AVBP_Msk           (0x7FFUL << LTDC_BPCR_AVBP_Pos)           /*!< 0x000007FF */
  #define LTDC_BPCR_AVBP               LTDC_BPCR_AVBP_Msk                        /*!< Accumulated Vertical Back Porch   */
  #define LTDC_BPCR_AHBP_Pos           (16U)
  #define LTDC_BPCR_AHBP_Msk           (0xFFFUL << LTDC_BPCR_AHBP_Pos)           /*!< 0x0FFF0000 */
  #define LTDC_BPCR_AHBP               LTDC_BPCR_AHBP_Msk                        /*!< Accumulated Horizontal Back Porch */
  
  /********************  Bit definition for LTDC_AWCR register  *****************/
  
  #define LTDC_AWCR_AAH_Pos            (0U)
  #define LTDC_AWCR_AAH_Msk            (0x7FFUL << LTDC_AWCR_AAH_Pos)            /*!< 0x000007FF */
  #define LTDC_AWCR_AAH                LTDC_AWCR_AAH_Msk                         /*!< Accumulated Active height */
  #define LTDC_AWCR_AAW_Pos            (16U)
  #define LTDC_AWCR_AAW_Msk            (0xFFFUL << LTDC_AWCR_AAW_Pos)            /*!< 0x0FFF0000 */
  #define LTDC_AWCR_AAW                LTDC_AWCR_AAW_Msk                         /*!< Accumulated Active Width */
  
