JPrier/LLMK/inc/system/stm32h723x.h
  /********************  Bit definition for RCC_RSR register  *******************/
  #define RCC_RSR_RMVF_Pos                       (16U)
  #define RCC_RSR_RMVF_Msk                       (0x1UL << RCC_RSR_RMVF_Pos)     /*!< 0x00010000 */
  #define RCC_RSR_RMVF                           RCC_RSR_RMVF_Msk
  #define RCC_RSR_CPURSTF_Pos                    (17U)
  #define RCC_RSR_CPURSTF_Msk                    (0x1UL << RCC_RSR_CPURSTF_Pos)  /*!< 0x00020000 */
  #define RCC_RSR_CPURSTF                        RCC_RSR_CPURSTF_Msk
  #define RCC_RSR_D1RSTF_Pos                     (19U)
  #define RCC_RSR_D1RSTF_Msk                     (0x1UL << RCC_RSR_D1RSTF_Pos)   /*!< 0x00080000 */
  #define RCC_RSR_D1RSTF                         RCC_RSR_D1RSTF_Msk
  #define RCC_RSR_D2RSTF_Pos                     (20U)
  #define RCC_RSR_D2RSTF_Msk                     (0x1UL << RCC_RSR_D2RSTF_Pos)   /*!< 0x00100000 */
  #define RCC_RSR_D2RSTF                         RCC_RSR_D2RSTF_Msk
  #define RCC_RSR_BORRSTF_Pos                    (21U)
  #define RCC_RSR_BORRSTF_Msk                    (0x1UL << RCC_RSR_BORRSTF_Pos)  /*!< 0x00200000 */
  #define RCC_RSR_BORRSTF                        RCC_RSR_BORRSTF_Msk
  #define RCC_RSR_PINRSTF_Pos                    (22U)
  #define RCC_RSR_PINRSTF_Msk                    (0x1UL << RCC_RSR_PINRSTF_Pos)  /*!< 0x00400000 */
  #define RCC_RSR_PINRSTF                        RCC_RSR_PINRSTF_Msk
  #define RCC_RSR_PORRSTF_Pos                    (23U)
  #define RCC_RSR_PORRSTF_Msk                    (0x1UL << RCC_RSR_PORRSTF_Pos)  /*!< 0x00800000 */
  #define RCC_RSR_PORRSTF                        RCC_RSR_PORRSTF_Msk
  #define RCC_RSR_SFTRSTF_Pos                    (24U)
  #define RCC_RSR_SFTRSTF_Msk                    (0x1UL << RCC_RSR_SFTRSTF_Pos)  /*!< 0x01000000 */
  #define RCC_RSR_SFTRSTF                        RCC_RSR_SFTRSTF_Msk
  #define RCC_RSR_IWDG1RSTF_Pos                  (26U)
  #define RCC_RSR_IWDG1RSTF_Msk                  (0x1UL << RCC_RSR_IWDG1RSTF_Pos) /*!< 0x04000000 */
  #define RCC_RSR_IWDG1RSTF                      RCC_RSR_IWDG1RSTF_Msk
  #define RCC_RSR_WWDG1RSTF_Pos                  (28U)
  #define RCC_RSR_WWDG1RSTF_Msk                  (0x1UL << RCC_RSR_WWDG1RSTF_Pos) /*!< 0x10000000 */
  #define RCC_RSR_WWDG1RSTF                      RCC_RSR_WWDG1RSTF_Msk
  
  #define RCC_RSR_LPWRRSTF_Pos                   (30U)
  #define RCC_RSR_LPWRRSTF_Msk                   (0x1UL << RCC_RSR_LPWRRSTF_Pos) /*!< 0x40000000 */
  #define RCC_RSR_LPWRRSTF                       RCC_RSR_LPWRRSTF_Msk
  
  
  /******************************************************************************/
  /*                                                                            */
  /*                                    RNG                                     */
  /*                                                                            */
  /******************************************************************************/
  /***************************    RNG VER  **************************************/
  #define RNG_VER_3_2
  /********************  Bits definition for RNG_CR register  *******************/
  #define RNG_CR_RNGEN_Pos    (2U)
  #define RNG_CR_RNGEN_Msk    (0x1UL << RNG_CR_RNGEN_Pos)                        /*!< 0x00000004 */
  #define RNG_CR_RNGEN        RNG_CR_RNGEN_Msk
  #define RNG_CR_IE_Pos       (3U)
  #define RNG_CR_IE_Msk       (0x1UL << RNG_CR_IE_Pos)                           /*!< 0x00000008 */
  #define RNG_CR_IE           RNG_CR_IE_Msk
  #define RNG_CR_CED_Pos      (5U)
  #define RNG_CR_CED_Msk      (0x1UL << RNG_CR_CED_Pos)                          /*!< 0x00000020 */
  #define RNG_CR_CED          RNG_CR_CED_Msk
  #define RNG_CR_RNG_CONFIG3_Pos      (8U)
  #define RNG_CR_RNG_CONFIG3_Msk      (0xFUL << RNG_CR_RNG_CONFIG3_Pos)          /*!< 0x00000F00 */
  #define RNG_CR_RNG_CONFIG3          RNG_CR_RNG_CONFIG3_Msk
  #define RNG_CR_NISTC_Pos            (12U)
  #define RNG_CR_NISTC_Msk            (0x1UL << RNG_CR_NISTC_Pos)                /*!< 0x00001000 */
  #define RNG_CR_NISTC                RNG_CR_NISTC_Msk
  #define RNG_CR_RNG_CONFIG2_Pos      (13U)
  #define RNG_CR_RNG_CONFIG2_Msk      (0x7UL << RNG_CR_RNG_CONFIG2_Pos)          /*!< 0x0000E000 */
  #define RNG_CR_RNG_CONFIG2          RNG_CR_RNG_CONFIG2_Msk
  #define RNG_CR_CLKDIV_Pos           (16U)
  #define RNG_CR_CLKDIV_Msk           (0xFUL << RNG_CR_CLKDIV_Pos)               /*!< 0x000F0000 */
  #define RNG_CR_CLKDIV               RNG_CR_CLKDIV_Msk
  #define RNG_CR_CLKDIV_0             (0x1U << RNG_CR_CLKDIV_Pos)                /*!< 0x00010000 */
  #define RNG_CR_CLKDIV_1             (0x2U << RNG_CR_CLKDIV_Pos)                /*!< 0x00020000 */
  #define RNG_CR_CLKDIV_2             (0x4U << RNG_CR_CLKDIV_Pos)                /*!< 0x00040000 */
  #define RNG_CR_CLKDIV_3             (0x8U << RNG_CR_CLKDIV_Pos)                /*!< 0x00080000 */
  #define RNG_CR_RNG_CONFIG1_Pos      (20U)
  #define RNG_CR_RNG_CONFIG1_Msk      (0x3FUL << RNG_CR_RNG_CONFIG1_Pos)         /*!< 0x03F00000 */
  #define RNG_CR_RNG_CONFIG1          RNG_CR_RNG_CONFIG1_Msk
  #define RNG_CR_CONDRST_Pos         (30U)
  #define RNG_CR_CONDRST_Msk         (0x1UL << RNG_CR_CONDRST_Pos)                  /*!< 0x40000000 */
  #define RNG_CR_CONDRST             RNG_CR_CONDRST_Msk
  #define RNG_CR_CONFIGLOCK_Pos      (31U)
  #define RNG_CR_CONFIGLOCK_Msk      (0x1UL << RNG_CR_CONFIGLOCK_Pos)            /*!< 0x80000000 */
  #define RNG_CR_CONFIGLOCK          RNG_CR_CONFIGLOCK_Msk
  
  /********************  Bits definition for RNG_SR register  *******************/
  #define RNG_SR_DRDY_Pos     (0U)
  #define RNG_SR_DRDY_Msk     (0x1UL << RNG_SR_DRDY_Pos)                         /*!< 0x00000001 */
  #define RNG_SR_DRDY         RNG_SR_DRDY_Msk
  #define RNG_SR_CECS_Pos     (1U)
  #define RNG_SR_CECS_Msk     (0x1UL << RNG_SR_CECS_Pos)                         /*!< 0x00000002 */
  #define RNG_SR_CECS         RNG_SR_CECS_Msk
  #define RNG_SR_SECS_Pos     (2U)
  #define RNG_SR_SECS_Msk     (0x1UL << RNG_SR_SECS_Pos)                         /*!< 0x00000004 */
  #define RNG_SR_SECS         RNG_SR_SECS_Msk
  #define RNG_SR_CEIS_Pos     (5U)
  #define RNG_SR_CEIS_Msk     (0x1UL << RNG_SR_CEIS_Pos)                         /*!< 0x00000020 */
  #define RNG_SR_CEIS         RNG_SR_CEIS_Msk
  #define RNG_SR_SEIS_Pos     (6U)
  #define RNG_SR_SEIS_Msk     (0x1UL << RNG_SR_SEIS_Pos)                         /*!< 0x00000040 */
  #define RNG_SR_SEIS         RNG_SR_SEIS_Msk
  
  /******************************************************************************/
  /*                                                                            */
  /*                           Real-Time Clock (RTC)                            */
  /*                                                                            */
  /******************************************************************************/
  /********************  Bits definition for RTC_TR register  *******************/
  #define RTC_TR_PM_Pos                  (22U)
  #define RTC_TR_PM_Msk                  (0x1UL << RTC_TR_PM_Pos)                /*!< 0x00400000 */
  #define RTC_TR_PM                      RTC_TR_PM_Msk
  #define RTC_TR_HT_Pos                  (20U)
  #define RTC_TR_HT_Msk                  (0x3UL << RTC_TR_HT_Pos)                /*!< 0x00300000 */
  #define RTC_TR_HT                      RTC_TR_HT_Msk
  #define RTC_TR_HT_0                    (0x1UL << RTC_TR_HT_Pos)                 /*!< 0x00100000 */
  #define RTC_TR_HT_1                    (0x2UL << RTC_TR_HT_Pos)                 /*!< 0x00200000 */
  #define RTC_TR_HU_Pos                  (16U)
  #define RTC_TR_HU_Msk                  (0xFUL << RTC_TR_HU_Pos)                /*!< 0x000F0000 */
  #define RTC_TR_HU                      RTC_TR_HU_Msk
  #define RTC_TR_HU_0                    (0x1UL << RTC_TR_HU_Pos)                 /*!< 0x00010000 */
  #define RTC_TR_HU_1                    (0x2UL << RTC_TR_HU_Pos)                 /*!< 0x00020000 */
  #define RTC_TR_HU_2                    (0x4UL << RTC_TR_HU_Pos)                 /*!< 0x00040000 */
  #define RTC_TR_HU_3                    (0x8UL << RTC_TR_HU_Pos)                 /*!< 0x00080000 */
  #define RTC_TR_MNT_Pos                 (12U)
  #define RTC_TR_MNT_Msk                 (0x7UL << RTC_TR_MNT_Pos)               /*!< 0x00007000 */
  #define RTC_TR_MNT                     RTC_TR_MNT_Msk
  #define RTC_TR_MNT_0                   (0x1UL << RTC_TR_MNT_Pos)                /*!< 0x00001000 */
  #define RTC_TR_MNT_1                   (0x2UL << RTC_TR_MNT_Pos)                /*!< 0x00002000 */
  #define RTC_TR_MNT_2                   (0x4UL << RTC_TR_MNT_Pos)                /*!< 0x00004000 */
  #define RTC_TR_MNU_Pos                 (8U)
  #define RTC_TR_MNU_Msk                 (0xFUL << RTC_TR_MNU_Pos)               /*!< 0x00000F00 */
  #define RTC_TR_MNU                     RTC_TR_MNU_Msk
  #define RTC_TR_MNU_0                   (0x1UL << RTC_TR_MNU_Pos)                /*!< 0x00000100 */
  #define RTC_TR_MNU_1                   (0x2UL << RTC_TR_MNU_Pos)                /*!< 0x00000200 */
  #define RTC_TR_MNU_2                   (0x4UL << RTC_TR_MNU_Pos)                /*!< 0x00000400 */
  #define RTC_TR_MNU_3                   (0x8UL << RTC_TR_MNU_Pos)                /*!< 0x00000800 */
  #define RTC_TR_ST_Pos                  (4U)
  #define RTC_TR_ST_Msk                  (0x7UL << RTC_TR_ST_Pos)                /*!< 0x00000070 */
  #define RTC_TR_ST                      RTC_TR_ST_Msk
  #define RTC_TR_ST_0                    (0x1UL << RTC_TR_ST_Pos)                 /*!< 0x00000010 */
  #define RTC_TR_ST_1                    (0x2UL << RTC_TR_ST_Pos)                 /*!< 0x00000020 */
  #define RTC_TR_ST_2                    (0x4UL << RTC_TR_ST_Pos)                 /*!< 0x00000040 */
  #define RTC_TR_SU_Pos                  (0U)
  #define RTC_TR_SU_Msk                  (0xFUL << RTC_TR_SU_Pos)                /*!< 0x0000000F */
  #define RTC_TR_SU                      RTC_TR_SU_Msk
  #define RTC_TR_SU_0                    (0x1UL << RTC_TR_SU_Pos)                 /*!< 0x00000001 */
  #define RTC_TR_SU_1                    (0x2UL << RTC_TR_SU_Pos)                 /*!< 0x00000002 */
  #define RTC_TR_SU_2                    (0x4UL << RTC_TR_SU_Pos)                 /*!< 0x00000004 */
  #define RTC_TR_SU_3                    (0x8UL << RTC_TR_SU_Pos)                 /*!< 0x00000008 */
  
