JPrier/LLMK/inc/system/stm32h723x.h
  /********************  Bits definition for RTC_CALR register  *****************/
  #define RTC_CALR_CALP_Pos              (15U)
  #define RTC_CALR_CALP_Msk              (0x1UL << RTC_CALR_CALP_Pos)            /*!< 0x00008000 */
  #define RTC_CALR_CALP                  RTC_CALR_CALP_Msk
  #define RTC_CALR_CALW8_Pos             (14U)
  #define RTC_CALR_CALW8_Msk             (0x1UL << RTC_CALR_CALW8_Pos)           /*!< 0x00004000 */
  #define RTC_CALR_CALW8                 RTC_CALR_CALW8_Msk
  #define RTC_CALR_CALW16_Pos            (13U)
  #define RTC_CALR_CALW16_Msk            (0x1UL << RTC_CALR_CALW16_Pos)          /*!< 0x00002000 */
  #define RTC_CALR_CALW16                RTC_CALR_CALW16_Msk
  #define RTC_CALR_CALM_Pos              (0U)
  #define RTC_CALR_CALM_Msk              (0x1FFUL << RTC_CALR_CALM_Pos)          /*!< 0x000001FF */
  #define RTC_CALR_CALM                  RTC_CALR_CALM_Msk
  #define RTC_CALR_CALM_0                (0x001UL << RTC_CALR_CALM_Pos)           /*!< 0x00000001 */
  #define RTC_CALR_CALM_1                (0x002UL << RTC_CALR_CALM_Pos)           /*!< 0x00000002 */
  #define RTC_CALR_CALM_2                (0x004UL << RTC_CALR_CALM_Pos)           /*!< 0x00000004 */
  #define RTC_CALR_CALM_3                (0x008UL << RTC_CALR_CALM_Pos)           /*!< 0x00000008 */
  #define RTC_CALR_CALM_4                (0x010UL << RTC_CALR_CALM_Pos)           /*!< 0x00000010 */
  #define RTC_CALR_CALM_5                (0x020UL << RTC_CALR_CALM_Pos)           /*!< 0x00000020 */
  #define RTC_CALR_CALM_6                (0x040UL << RTC_CALR_CALM_Pos)           /*!< 0x00000040 */
  #define RTC_CALR_CALM_7                (0x080UL << RTC_CALR_CALM_Pos)           /*!< 0x00000080 */
  #define RTC_CALR_CALM_8                (0x100UL << RTC_CALR_CALM_Pos)           /*!< 0x00000100 */
  
  /********************  Bits definition for RTC_TAFCR register  ***************/
  #define RTC_TAFCR_PC15MODE_Pos         (23U)
  #define RTC_TAFCR_PC15MODE_Msk         (0x1UL << RTC_TAFCR_PC15MODE_Pos)      /*!< 0x00800000 */
  #define RTC_TAFCR_PC15MODE             RTC_TAFCR_PC15MODE_Msk
  #define RTC_TAFCR_PC15VALUE_Pos        (22U)
  #define RTC_TAFCR_PC15VALUE_Msk        (0x1UL << RTC_TAFCR_PC15VALUE_Pos)     /*!< 0x00400000 */
  #define RTC_TAFCR_PC15VALUE            RTC_TAFCR_PC15VALUE_Msk
  #define RTC_TAFCR_PC14MODE_Pos         (21U)
  #define RTC_TAFCR_PC14MODE_Msk         (0x1UL << RTC_TAFCR_PC14MODE_Pos)      /*!< 0x00200000 */
  #define RTC_TAFCR_PC14MODE             RTC_TAFCR_PC14MODE_Msk
  #define RTC_TAFCR_PC14VALUE_Pos        (20U)
  #define RTC_TAFCR_PC14VALUE_Msk        (0x1UL << RTC_TAFCR_PC14VALUE_Pos)     /*!< 0x00100000 */
  #define RTC_TAFCR_PC14VALUE            RTC_TAFCR_PC14VALUE_Msk
  #define RTC_TAFCR_PC13MODE_Pos         (19U)
  #define RTC_TAFCR_PC13MODE_Msk         (0x1UL << RTC_TAFCR_PC13MODE_Pos)      /*!< 0x00080000 */
  #define RTC_TAFCR_PC13MODE             RTC_TAFCR_PC13MODE_Msk
  #define RTC_TAFCR_PC13VALUE_Pos        (18U)
  #define RTC_TAFCR_PC13VALUE_Msk        (0x1UL << RTC_TAFCR_PC13VALUE_Pos)     /*!< 0x00040000 */
  #define RTC_TAFCR_PC13VALUE            RTC_TAFCR_PC13VALUE_Msk
  #define RTC_TAFCR_TAMPPUDIS_Pos        (15U)
  #define RTC_TAFCR_TAMPPUDIS_Msk        (0x1UL << RTC_TAFCR_TAMPPUDIS_Pos)     /*!< 0x00008000 */
  #define RTC_TAFCR_TAMPPUDIS            RTC_TAFCR_TAMPPUDIS_Msk
  #define RTC_TAFCR_TAMPPRCH_Pos         (13U)
  #define RTC_TAFCR_TAMPPRCH_Msk         (0x3UL << RTC_TAFCR_TAMPPRCH_Pos)      /*!< 0x00006000 */
  #define RTC_TAFCR_TAMPPRCH             RTC_TAFCR_TAMPPRCH_Msk
  #define RTC_TAFCR_TAMPPRCH_0           (0x1UL << RTC_TAFCR_TAMPPRCH_Pos)       /*!< 0x00002000 */
  #define RTC_TAFCR_TAMPPRCH_1           (0x2UL << RTC_TAFCR_TAMPPRCH_Pos)       /*!< 0x00004000 */
  #define RTC_TAFCR_TAMPFLT_Pos          (11U)
  #define RTC_TAFCR_TAMPFLT_Msk          (0x3UL << RTC_TAFCR_TAMPFLT_Pos)       /*!< 0x00001800 */
  #define RTC_TAFCR_TAMPFLT              RTC_TAFCR_TAMPFLT_Msk
  #define RTC_TAFCR_TAMPFLT_0            (0x1UL << RTC_TAFCR_TAMPFLT_Pos)        /*!< 0x00000800 */
  #define RTC_TAFCR_TAMPFLT_1            (0x2UL << RTC_TAFCR_TAMPFLT_Pos)        /*!< 0x00001000 */
  #define RTC_TAFCR_TAMPFREQ_Pos         (8U)
  #define RTC_TAFCR_TAMPFREQ_Msk         (0x7UL << RTC_TAFCR_TAMPFREQ_Pos)      /*!< 0x00000700 */
  #define RTC_TAFCR_TAMPFREQ             RTC_TAFCR_TAMPFREQ_Msk
  #define RTC_TAFCR_TAMPFREQ_0           (0x1UL << RTC_TAFCR_TAMPFREQ_Pos)       /*!< 0x00000100 */
  #define RTC_TAFCR_TAMPFREQ_1           (0x2UL << RTC_TAFCR_TAMPFREQ_Pos)       /*!< 0x00000200 */
  #define RTC_TAFCR_TAMPFREQ_2           (0x4UL << RTC_TAFCR_TAMPFREQ_Pos)       /*!< 0x00000400 */
  #define RTC_TAFCR_TAMPTS_Pos           (7U)
  #define RTC_TAFCR_TAMPTS_Msk           (0x1UL << RTC_TAFCR_TAMPTS_Pos)        /*!< 0x00000080 */
  #define RTC_TAFCR_TAMPTS               RTC_TAFCR_TAMPTS_Msk
  #define RTC_TAFCR_TAMP3TRG_Pos         (6U)
  #define RTC_TAFCR_TAMP3TRG_Msk         (0x1UL << RTC_TAFCR_TAMP3TRG_Pos)      /*!< 0x00000040 */
  #define RTC_TAFCR_TAMP3TRG             RTC_TAFCR_TAMP3TRG_Msk
  #define RTC_TAFCR_TAMP3E_Pos           (5U)
  #define RTC_TAFCR_TAMP3E_Msk           (0x1UL << RTC_TAFCR_TAMP3E_Pos)        /*!< 0x00000020 */
  #define RTC_TAFCR_TAMP3E               RTC_TAFCR_TAMP3E_Msk
  #define RTC_TAFCR_TAMPIE_Pos           (2U)
  #define RTC_TAFCR_TAMPIE_Msk           (0x1UL << RTC_TAFCR_TAMPIE_Pos)        /*!< 0x00000004 */
  #define RTC_TAFCR_TAMPIE               RTC_TAFCR_TAMPIE_Msk
  #define RTC_TAFCR_TAMP1TRG_Pos         (1U)
  #define RTC_TAFCR_TAMP1TRG_Msk         (0x1UL << RTC_TAFCR_TAMP1TRG_Pos)      /*!< 0x00000002 */
  #define RTC_TAFCR_TAMP1TRG             RTC_TAFCR_TAMP1TRG_Msk
  #define RTC_TAFCR_TAMP1E_Pos           (0U)
  #define RTC_TAFCR_TAMP1E_Msk           (0x1UL << RTC_TAFCR_TAMP1E_Pos)        /*!< 0x00000001 */
  #define RTC_TAFCR_TAMP1E               RTC_TAFCR_TAMP1E_Msk
  
  /* Aliases for RTC TAFCR */
  #define TAMPCR                         TAFCR
  #define RTC_TAMPCR_TAMPPUDIS_Pos       RTC_TAFCR_TAMPPUDIS_Pos
  #define RTC_TAMPCR_TAMPPUDIS_Msk       RTC_TAFCR_TAMPPUDIS_Msk
  #define RTC_TAMPCR_TAMPPUDIS           RTC_TAFCR_TAMPPUDIS
  #define RTC_TAMPCR_TAMPPRCH_Pos        RTC_TAFCR_TAMPPRCH_Pos
  #define RTC_TAMPCR_TAMPPRCH_Msk        RTC_TAFCR_TAMPPRCH_Msk
  #define RTC_TAMPCR_TAMPPRCH            RTC_TAFCR_TAMPPRCH
  #define RTC_TAMPCR_TAMPPRCH_0          RTC_TAFCR_TAMPPRCH_0
  #define RTC_TAMPCR_TAMPPRCH_1          RTC_TAFCR_TAMPPRCH_1
  #define RTC_TAMPCR_TAMPFLT_Pos         RTC_TAFCR_TAMPFLT_Pos
  #define RTC_TAMPCR_TAMPFLT_Msk         RTC_TAFCR_TAMPFLT_Msk
  #define RTC_TAMPCR_TAMPFLT             RTC_TAFCR_TAMPFLT
  #define RTC_TAMPCR_TAMPFLT_0           RTC_TAFCR_TAMPFLT_0
  #define RTC_TAMPCR_TAMPFLT_1           RTC_TAFCR_TAMPFLT_1
  #define RTC_TAMPCR_TAMPFREQ_Pos        RTC_TAFCR_TAMPFREQ_Pos
  #define RTC_TAMPCR_TAMPFREQ_Msk        RTC_TAFCR_TAMPFREQ_Msk
  #define RTC_TAMPCR_TAMPFREQ            RTC_TAFCR_TAMPFREQ
  #define RTC_TAMPCR_TAMPFREQ_0          RTC_TAFCR_TAMPFREQ_0
  #define RTC_TAMPCR_TAMPFREQ_1          RTC_TAFCR_TAMPFREQ_1
  #define RTC_TAMPCR_TAMPFREQ_2          RTC_TAFCR_TAMPFREQ_2
  #define RTC_TAMPCR_TAMPTS_Pos          RTC_TAFCR_TAMPTS_Pos
  #define RTC_TAMPCR_TAMPTS_Msk          RTC_TAFCR_TAMPTS_Msk
  #define RTC_TAMPCR_TAMPTS              RTC_TAFCR_TAMPTS
  #define RTC_TAMPCR_TAMP3TRG_Pos        RTC_TAFCR_TAMP3TRG_Pos
  #define RTC_TAMPCR_TAMP3TRG_Msk        RTC_TAFCR_TAMP3TRG_Msk
  #define RTC_TAMPCR_TAMP3TRG            RTC_TAFCR_TAMP3TRG
  #define RTC_TAMPCR_TAMP3E_Pos          RTC_TAFCR_TAMP3E_Pos
  #define RTC_TAMPCR_TAMP3E_Msk          RTC_TAFCR_TAMP3E_Msk
  #define RTC_TAMPCR_TAMP3E              RTC_TAFCR_TAMP3E
  #define RTC_TAMPCR_TAMPIE_Pos          RTC_TAFCR_TAMPIE_Pos
  #define RTC_TAMPCR_TAMPIE_Msk          RTC_TAFCR_TAMPIE_Msk
  #define RTC_TAMPCR_TAMPIE              RTC_TAFCR_TAMPIE
  #define RTC_TAMPCR_TAMP1TRG_Pos        RTC_TAFCR_TAMP1TRG_Pos
  #define RTC_TAMPCR_TAMP1TRG_Msk        RTC_TAFCR_TAMP1TRG_Msk
  #define RTC_TAMPCR_TAMP1TRG            RTC_TAFCR_TAMP1TRG
  #define RTC_TAMPCR_TAMP1E_Pos          RTC_TAFCR_TAMP1E_Pos
  #define RTC_TAMPCR_TAMP1E_Msk          RTC_TAFCR_TAMP1E_Msk
  #define RTC_TAMPCR_TAMP1E              RTC_TAFCR_TAMP1E
  
