JPrier/LLMK/inc/system/stm32h723x.h
  /******************************* ADC Instances ********************************/
  #define IS_ADC_ALL_INSTANCE(INSTANCE) (((INSTANCE) == ADC1) || \
                                         ((INSTANCE) == ADC2) || \
                                         ((INSTANCE) == ADC3))
  
  #define IS_ADC_MULTIMODE_MASTER_INSTANCE(INSTANCE) ((INSTANCE) == ADC1)
  
  #define IS_ADC_COMMON_INSTANCE(INSTANCE) (((INSTANCE) == ADC12_COMMON) ||\
                                            ((INSTANCE) == ADC3_COMMON))
  
  /******************************* CORDIC Instances *****************************/
  #define IS_CORDIC_ALL_INSTANCE(INSTANCE) ((INSTANCE) == CORDIC)
  
  /******************************** FMAC Instances ******************************/
  #define IS_FMAC_ALL_INSTANCE(INSTANCE) ((INSTANCE) == FMAC)
  
  /******************************** COMP Instances ******************************/
  #define IS_COMP_ALL_INSTANCE(INSTANCE) (((INSTANCE) == COMP1) || \
                                         ((INSTANCE) == COMP2))
  
  #define IS_COMP_COMMON_INSTANCE(INSTANCE) ((INSTANCE) == COMP12_COMMON)
  /******************** COMP Instances with window mode capability **************/
  #define IS_COMP_WINDOWMODE_INSTANCE(INSTANCE) ((INSTANCE) == COMP2)
  
  /******************************** DTS Instances ******************************/
  #define IS_DTS_ALL_INSTANCE(INSTANCE) ((INSTANCE) == DTS)
  
  /******************************* CRC Instances ********************************/
  #define IS_CRC_ALL_INSTANCE(INSTANCE) ((INSTANCE) == CRC)
  
  /******************************* DAC Instances ********************************/
  #define IS_DAC_ALL_INSTANCE(INSTANCE) ((INSTANCE) == DAC1)
  /******************************* DCMI Instances *******************************/
  #define IS_DCMI_ALL_INSTANCE(__INSTANCE__) ((__INSTANCE__) == DCMI)
  
  /******************************* DELAYBLOCK Instances *******************************/
  #define IS_DLYB_ALL_INSTANCE(INSTANCE)  (((INSTANCE) == DLYB_SDMMC1) || \
                                           ((INSTANCE) == DLYB_SDMMC2) || \
                                           ((INSTANCE) == DLYB_OCTOSPI1) || \
                                           ((INSTANCE) == DLYB_OCTOSPI2) )
  /****************************** DFSDM Instances *******************************/
  #define IS_DFSDM_FILTER_ALL_INSTANCE(INSTANCE) (((INSTANCE) == DFSDM1_Filter0) || \
                                                 ((INSTANCE) == DFSDM1_Filter1) || \
                                                 ((INSTANCE) == DFSDM1_Filter2) || \
                                                 ((INSTANCE) == DFSDM1_Filter3))
  
  #define IS_DFSDM_CHANNEL_ALL_INSTANCE(INSTANCE) (((INSTANCE) == DFSDM1_Channel0) || \
                                                   ((INSTANCE) == DFSDM1_Channel1) || \
                                                   ((INSTANCE) == DFSDM1_Channel2) || \
                                                   ((INSTANCE) == DFSDM1_Channel3) || \
                                                   ((INSTANCE) == DFSDM1_Channel4) || \
                                                   ((INSTANCE) == DFSDM1_Channel5) || \
                                                   ((INSTANCE) == DFSDM1_Channel6) || \
                                                   ((INSTANCE) == DFSDM1_Channel7))
  /****************************** RAMECC Instances ******************************/
  #define IS_RAMECC_MONITOR_ALL_INSTANCE(INSTANCE) (((INSTANCE) == RAMECC1_Monitor1)   || \
                                                    ((INSTANCE) == RAMECC1_Monitor2)   || \
                                                    ((INSTANCE) == RAMECC1_Monitor3)   || \
                                                    ((INSTANCE) == RAMECC1_Monitor4)   || \
                                                    ((INSTANCE) == RAMECC1_Monitor5)   || \
                                                    ((INSTANCE) == RAMECC1_Monitor6)   || \
                                                    ((INSTANCE) == RAMECC2_Monitor1)   || \
                                                    ((INSTANCE) == RAMECC2_Monitor2)   || \
                                                    ((INSTANCE) == RAMECC2_Monitor3)   || \
                                                    ((INSTANCE) == RAMECC3_Monitor1)   || \
                                                    ((INSTANCE) == RAMECC3_Monitor2))
  
  /******************************** DMA Instances *******************************/
  #define IS_DMA_ALL_INSTANCE(INSTANCE) (((INSTANCE) == DMA1_Stream0)   || \
                                         ((INSTANCE) == DMA1_Stream1)   || \
                                         ((INSTANCE) == DMA1_Stream2)   || \
                                         ((INSTANCE) == DMA1_Stream3)   || \
                                         ((INSTANCE) == DMA1_Stream4)   || \
                                         ((INSTANCE) == DMA1_Stream5)   || \
                                         ((INSTANCE) == DMA1_Stream6)   || \
                                         ((INSTANCE) == DMA1_Stream7)   || \
                                         ((INSTANCE) == DMA2_Stream0)   || \
                                         ((INSTANCE) == DMA2_Stream1)   || \
                                         ((INSTANCE) == DMA2_Stream2)   || \
                                         ((INSTANCE) == DMA2_Stream3)   || \
                                         ((INSTANCE) == DMA2_Stream4)   || \
                                         ((INSTANCE) == DMA2_Stream5)   || \
                                         ((INSTANCE) == DMA2_Stream6)   || \
                                         ((INSTANCE) == DMA2_Stream7)   || \
                                         ((INSTANCE) == BDMA_Channel0) || \
                                         ((INSTANCE) == BDMA_Channel1) || \
                                         ((INSTANCE) == BDMA_Channel2) || \
                                         ((INSTANCE) == BDMA_Channel3) || \
                                         ((INSTANCE) == BDMA_Channel4) || \
                                         ((INSTANCE) == BDMA_Channel5) || \
                                         ((INSTANCE) == BDMA_Channel6) || \
                                         ((INSTANCE) == BDMA_Channel7))
  
