JPrier/LLMK/inc/system/stm32h723x.h
  /****************************** BDMA CHANNEL Instances ***************************/
  #define IS_BDMA_CHANNEL_INSTANCE(INSTANCE) (((INSTANCE) == BDMA_Channel0) || \
                                              ((INSTANCE) == BDMA_Channel1) || \
                                              ((INSTANCE) == BDMA_Channel2) || \
                                              ((INSTANCE) == BDMA_Channel3) || \
                                              ((INSTANCE) == BDMA_Channel4) || \
                                              ((INSTANCE) == BDMA_Channel5) || \
                                              ((INSTANCE) == BDMA_Channel6) || \
                                              ((INSTANCE) == BDMA_Channel7))
  
  /****************************** DMA DMAMUX ALL Instances ***************************/
  #define IS_DMA_DMAMUX_ALL_INSTANCE(INSTANCE)  (((INSTANCE) == DMA1_Stream0)    || \
                                                 ((INSTANCE) == DMA1_Stream1)    || \
                                                 ((INSTANCE) == DMA1_Stream2)    || \
                                                 ((INSTANCE) == DMA1_Stream3)    || \
                                                 ((INSTANCE) == DMA1_Stream4)    || \
                                                 ((INSTANCE) == DMA1_Stream5)    || \
                                                 ((INSTANCE) == DMA1_Stream6)    || \
                                                 ((INSTANCE) == DMA1_Stream7)    || \
                                                 ((INSTANCE) == DMA2_Stream0)    || \
                                                 ((INSTANCE) == DMA2_Stream1)    || \
                                                 ((INSTANCE) == DMA2_Stream2)    || \
                                                 ((INSTANCE) == DMA2_Stream3)    || \
                                                 ((INSTANCE) == DMA2_Stream4)    || \
                                                 ((INSTANCE) == DMA2_Stream5)    || \
                                                 ((INSTANCE) == DMA2_Stream6)    || \
                                                 ((INSTANCE) == DMA2_Stream7)    || \
                                                 ((INSTANCE) == BDMA_Channel0)   || \
                                                 ((INSTANCE) == BDMA_Channel1)   || \
                                                 ((INSTANCE) == BDMA_Channel2)   || \
                                                 ((INSTANCE) == BDMA_Channel3)   || \
                                                 ((INSTANCE) == BDMA_Channel4)   || \
                                                 ((INSTANCE) == BDMA_Channel5)   || \
                                                 ((INSTANCE) == BDMA_Channel6)   || \
                                                 ((INSTANCE) == BDMA_Channel7))
  
  /****************************** BDMA DMAMUX Instances ***************************/
  #define IS_BDMA_CHANNEL_DMAMUX_INSTANCE(INSTANCE)  (((INSTANCE) == BDMA_Channel0) || \
                                                      ((INSTANCE) == BDMA_Channel1) || \
                                                      ((INSTANCE) == BDMA_Channel2) || \
                                                      ((INSTANCE) == BDMA_Channel3) || \
                                                      ((INSTANCE) == BDMA_Channel4) || \
                                                      ((INSTANCE) == BDMA_Channel5) || \
                                                      ((INSTANCE) == BDMA_Channel6) || \
                                                      ((INSTANCE) == BDMA_Channel7))
  
  /****************************** DMA STREAM Instances ***************************/
  #define IS_DMA_STREAM_INSTANCE(INSTANCE) (((INSTANCE) == DMA1_Stream0)   || \
                                            ((INSTANCE) == DMA1_Stream1)   || \
                                            ((INSTANCE) == DMA1_Stream2)   || \
                                            ((INSTANCE) == DMA1_Stream3)   || \
                                            ((INSTANCE) == DMA1_Stream4)   || \
                                            ((INSTANCE) == DMA1_Stream5)   || \
                                            ((INSTANCE) == DMA1_Stream6)   || \
                                            ((INSTANCE) == DMA1_Stream7)   || \
                                            ((INSTANCE) == DMA2_Stream0)   || \
                                            ((INSTANCE) == DMA2_Stream1)   || \
                                            ((INSTANCE) == DMA2_Stream2)   || \
                                            ((INSTANCE) == DMA2_Stream3)   || \
                                            ((INSTANCE) == DMA2_Stream4)   || \
                                            ((INSTANCE) == DMA2_Stream5)   || \
                                            ((INSTANCE) == DMA2_Stream6)   || \
                                            ((INSTANCE) == DMA2_Stream7))
  
  /****************************** DMA DMAMUX Instances ***************************/
  #define IS_DMA_STREAM_DMAMUX_INSTANCE(INSTANCE)  (((INSTANCE) == DMA1_Stream0)   || \
                                                    ((INSTANCE) == DMA1_Stream1)   || \
                                                    ((INSTANCE) == DMA1_Stream2)   || \
                                                    ((INSTANCE) == DMA1_Stream3)   || \
                                                    ((INSTANCE) == DMA1_Stream4)   || \
                                                    ((INSTANCE) == DMA1_Stream5)   || \
                                                    ((INSTANCE) == DMA1_Stream6)   || \
                                                    ((INSTANCE) == DMA1_Stream7)   || \
                                                    ((INSTANCE) == DMA2_Stream0)   || \
                                                    ((INSTANCE) == DMA2_Stream1)   || \
                                                    ((INSTANCE) == DMA2_Stream2)   || \
                                                    ((INSTANCE) == DMA2_Stream3)   || \
                                                    ((INSTANCE) == DMA2_Stream4)   || \
                                                    ((INSTANCE) == DMA2_Stream5)   || \
                                                    ((INSTANCE) == DMA2_Stream6)   || \
                                                    ((INSTANCE) == DMA2_Stream7))
  
  /******************************** DMA Request Generator Instances **************/
  #define IS_DMA_REQUEST_GEN_ALL_INSTANCE(INSTANCE) (((INSTANCE) == DMAMUX1_RequestGenerator0) || \
                                                     ((INSTANCE) == DMAMUX1_RequestGenerator1) || \
                                                     ((INSTANCE) == DMAMUX1_RequestGenerator2) || \
                                                     ((INSTANCE) == DMAMUX1_RequestGenerator3) || \
                                                     ((INSTANCE) == DMAMUX1_RequestGenerator4) || \
                                                     ((INSTANCE) == DMAMUX1_RequestGenerator5) || \
                                                     ((INSTANCE) == DMAMUX1_RequestGenerator6) || \
                                                     ((INSTANCE) == DMAMUX1_RequestGenerator7) || \
                                                     ((INSTANCE) == DMAMUX2_RequestGenerator0) || \
                                                     ((INSTANCE) == DMAMUX2_RequestGenerator1) || \
                                                     ((INSTANCE) == DMAMUX2_RequestGenerator2) || \
                                                     ((INSTANCE) == DMAMUX2_RequestGenerator3) || \
                                                     ((INSTANCE) == DMAMUX2_RequestGenerator4) || \
                                                     ((INSTANCE) == DMAMUX2_RequestGenerator5) || \
                                                     ((INSTANCE) == DMAMUX2_RequestGenerator6) || \
                                                     ((INSTANCE) == DMAMUX2_RequestGenerator7))
  
  /******************************* DMA2D Instances *******************************/
  #define IS_DMA2D_ALL_INSTANCE(__INSTANCE__) ((__INSTANCE__) == DMA2D)
  
  /****************************** PSSI Instance *********************************/
  #define IS_PSSI_ALL_INSTANCE(INSTANCE) ((INSTANCE) == PSSI)
  
  /******************************** MDMA Request Generator Instances **************/
  #define IS_MDMA_STREAM_ALL_INSTANCE(INSTANCE) (((INSTANCE) == MDMA_Channel0)  || \
                                                 ((INSTANCE) == MDMA_Channel1)  || \
                                                 ((INSTANCE) == MDMA_Channel2)  || \
                                                 ((INSTANCE) == MDMA_Channel3)  || \
                                                 ((INSTANCE) == MDMA_Channel4)  || \
                                                 ((INSTANCE) == MDMA_Channel5)  || \
                                                 ((INSTANCE) == MDMA_Channel6)  || \
                                                 ((INSTANCE) == MDMA_Channel7)  || \
                                                 ((INSTANCE) == MDMA_Channel8)  || \
                                                 ((INSTANCE) == MDMA_Channel9)  || \
                                                 ((INSTANCE) == MDMA_Channel10) || \
                                                 ((INSTANCE) == MDMA_Channel11) || \
                                                 ((INSTANCE) == MDMA_Channel12) || \
                                                 ((INSTANCE) == MDMA_Channel13) || \
                                                 ((INSTANCE) == MDMA_Channel14) || \
                                                 ((INSTANCE) == MDMA_Channel15))
  
  
  /******************************* FDCAN Instances ******************************/
  #define IS_FDCAN_ALL_INSTANCE(__INSTANCE__) (((__INSTANCE__) == FDCAN1) || \
                                               ((__INSTANCE__) == FDCAN2) || \
                                               ((__INSTANCE__) == FDCAN3))
  
  #define IS_FDCAN_TT_INSTANCE(__INSTANCE__) ((__INSTANCE__) == FDCAN1)
  
