JPrier/LLMK/inc/system/stm32h723x.h
  /******************************* GPIO Instances *******************************/
  #define IS_GPIO_ALL_INSTANCE(INSTANCE) (((INSTANCE) == GPIOA) || \
                                          ((INSTANCE) == GPIOB) || \
                                          ((INSTANCE) == GPIOC) || \
                                          ((INSTANCE) == GPIOD) || \
                                          ((INSTANCE) == GPIOE) || \
                                          ((INSTANCE) == GPIOF) || \
                                          ((INSTANCE) == GPIOG) || \
                                          ((INSTANCE) == GPIOH) || \
                                          ((INSTANCE) == GPIOJ) || \
                                          ((INSTANCE) == GPIOK))
  
  /******************************* GPIO AF Instances ****************************/
  #define IS_GPIO_AF_INSTANCE(INSTANCE)   IS_GPIO_ALL_INSTANCE(INSTANCE)
  
  /**************************** GPIO Lock Instances *****************************/
  /* On H7, all GPIO Bank support the Lock mechanism */
  #define IS_GPIO_LOCK_INSTANCE(INSTANCE) IS_GPIO_ALL_INSTANCE(INSTANCE)
  
  /******************************** HSEM Instances *******************************/
  #define IS_HSEM_ALL_INSTANCE(INSTANCE) ((INSTANCE) == HSEM)
  #define HSEM_CPU1_COREID         (0x00000003U) /* Semaphore Core CM7 ID */
  #define HSEM_CR_COREID_CPU1      (HSEM_CPU1_COREID << HSEM_CR_COREID_Pos)
  #define HSEM_CR_COREID_CURRENT   (HSEM_CPU1_COREID << HSEM_CR_COREID_Pos)
  
  #define HSEM_SEMID_MIN     (0U)       /* HSEM ID Min*/
  #define HSEM_SEMID_MAX     (31U)      /* HSEM ID Max */
  
  #define HSEM_PROCESSID_MIN (0U)       /* HSEM Process ID Min */
  #define HSEM_PROCESSID_MAX (255U)     /* HSEM Process ID Max */
  
  #define HSEM_CLEAR_KEY_MIN (0U)       /* HSEM clear Key Min value */
  #define HSEM_CLEAR_KEY_MAX (0xFFFFU)  /* HSEM clear Key Max value */
  
  /******************************** I2C Instances *******************************/
  #define IS_I2C_ALL_INSTANCE(INSTANCE) (((INSTANCE) == I2C1) || \
                                         ((INSTANCE) == I2C2) || \
                                         ((INSTANCE) == I2C3) || \
                                         ((INSTANCE) == I2C4) || \
                                         ((INSTANCE) == I2C5))
  
  /****************************** SMBUS Instances *******************************/
  #define IS_SMBUS_ALL_INSTANCE(INSTANCE) (((INSTANCE) == I2C1) || \
                                           ((INSTANCE) == I2C2) || \
                                           ((INSTANCE) == I2C3) || \
                                           ((INSTANCE) == I2C4) || \
                                           ((INSTANCE) == I2C5))
  
  /************** I2C Instances : wakeup capability from stop modes *************/
  #define IS_I2C_WAKEUP_FROMSTOP_INSTANCE(INSTANCE) IS_I2C_ALL_INSTANCE(INSTANCE)
  
  /******************************** I2S Instances *******************************/
  #define IS_I2S_ALL_INSTANCE(INSTANCE)   (((INSTANCE) == SPI1) || \
                                           ((INSTANCE) == SPI2) || \
                                           ((INSTANCE) == SPI3))
  
  /****************************** LTDC Instances ********************************/
  #define IS_LTDC_ALL_INSTANCE(INSTANCE)  ((INSTANCE) == LTDC)
  
  /******************************* RNG Instances ********************************/
  #define IS_RNG_ALL_INSTANCE(INSTANCE)  ((INSTANCE) == RNG)
  
  /****************************** RTC Instances *********************************/
  #define IS_RTC_ALL_INSTANCE(INSTANCE)  ((INSTANCE) == RTC)
  
  /****************************** SDMMC Instances *********************************/
  #define IS_SDMMC_ALL_INSTANCE(_INSTANCE_) (((_INSTANCE_) == SDMMC1) || \
                                             ((_INSTANCE_) == SDMMC2))
  
  /******************************** SPI Instances *******************************/
  #define IS_SPI_ALL_INSTANCE(INSTANCE) (((INSTANCE) == SPI1) || \
                                         ((INSTANCE) == SPI2) || \
                                         ((INSTANCE) == SPI3) || \
                                         ((INSTANCE) == SPI4) || \
                                         ((INSTANCE) == SPI5) || \
                                         ((INSTANCE) == SPI6))
  
  #define IS_SPI_HIGHEND_INSTANCE(INSTANCE) (((INSTANCE) == SPI1) || \
                                             ((INSTANCE) == SPI2) || \
                                             ((INSTANCE) == SPI3))
  
  /******************************** SWPMI Instances *****************************/
  #define IS_SWPMI_INSTANCE(INSTANCE)  ((INSTANCE) == SWPMI1)
  
  /****************** LPTIM Instances : All supported instances *****************/
  #define IS_LPTIM_INSTANCE(INSTANCE)     (((INSTANCE) == LPTIM1) || \
                                           ((INSTANCE) == LPTIM2) || \
                                           ((INSTANCE) == LPTIM3) || \
                                           ((INSTANCE) == LPTIM4) || \
                                           ((INSTANCE) == LPTIM5))
  
  /****************** LPTIM Instances : supporting encoder interface **************/
  #define IS_LPTIM_ENCODER_INTERFACE_INSTANCE(INSTANCE)     (((INSTANCE) == LPTIM1) || \
                                                             ((INSTANCE) == LPTIM2))
  
  /****************** TIM Instances : All supported instances *******************/
  #define IS_TIM_INSTANCE(INSTANCE)       (((INSTANCE) == TIM1)   || \
                                           ((INSTANCE) == TIM2)   || \
                                           ((INSTANCE) == TIM3)   || \
                                           ((INSTANCE) == TIM4)   || \
                                           ((INSTANCE) == TIM5)   || \
                                           ((INSTANCE) == TIM6)   || \
                                           ((INSTANCE) == TIM7)   || \
                                           ((INSTANCE) == TIM8)   || \
                                           ((INSTANCE) == TIM12)  || \
                                           ((INSTANCE) == TIM13)  || \
                                           ((INSTANCE) == TIM14)  || \
                                           ((INSTANCE) == TIM15)  || \
                                           ((INSTANCE) == TIM16)  || \
                                           ((INSTANCE) == TIM17)  || \
                                           ((INSTANCE) == TIM23)  || \
                                           ((INSTANCE) == TIM24))
  
  /************* TIM Instances : at least 1 capture/compare channel *************/
  #define IS_TIM_CC1_INSTANCE(INSTANCE)   (((INSTANCE) == TIM1)   || \
                                           ((INSTANCE) == TIM2)   || \
                                           ((INSTANCE) == TIM3)   || \
                                           ((INSTANCE) == TIM4)   || \
                                           ((INSTANCE) == TIM5)   || \
                                           ((INSTANCE) == TIM8)   || \
                                           ((INSTANCE) == TIM12)  || \
                                           ((INSTANCE) == TIM13)  || \
                                           ((INSTANCE) == TIM14)  || \
                                           ((INSTANCE) == TIM15)  || \
                                           ((INSTANCE) == TIM16)  || \
                                           ((INSTANCE) == TIM17)  || \
                                           ((INSTANCE) == TIM23)  || \
                                           ((INSTANCE) == TIM24))
  
