JPrier/LLMK/inc/system/stm32h723x.h
  /*************** TIM Instances : external trigger reamp input available *******/
  #define IS_TIM_ETR_INSTANCE(INSTANCE)     (((INSTANCE) == TIM1)   || \
                                             ((INSTANCE) == TIM2)   || \
                                             ((INSTANCE) == TIM3)   || \
                                             ((INSTANCE) == TIM4)   || \
                                             ((INSTANCE) == TIM5)   || \
                                             ((INSTANCE) == TIM8)   || \
                                             ((INSTANCE) == TIM23)   || \
                                             ((INSTANCE) == TIM24))
  
  /****************** TIM Instances : remapping capability **********************/
  #define IS_TIM_REMAP_INSTANCE(INSTANCE) (((INSTANCE) == TIM1)  || \
                                           ((INSTANCE) == TIM2)  || \
                                           ((INSTANCE) == TIM3)  || \
                                           ((INSTANCE) == TIM5)  || \
                                           ((INSTANCE) == TIM8)  || \
                                           ((INSTANCE) == TIM16) || \
                                           ((INSTANCE) == TIM17) || \
                                           ((INSTANCE) == TIM23) || \
                                           ((INSTANCE) == TIM24))
  
  /*************** TIM Instances : external trigger reamp input available *******/
  #define IS_TIM_ETRSEL_INSTANCE(INSTANCE)     (((INSTANCE) == TIM1)  || \
                                                ((INSTANCE) == TIM2)  || \
                                                ((INSTANCE) == TIM3)  || \
                                                ((INSTANCE) == TIM5)  || \
                                                ((INSTANCE) == TIM8)  || \
                                                ((INSTANCE) == TIM23) || \
                                                ((INSTANCE) == TIM24)))
  
  /****** TIM Instances : master mode available (TIMx_CR2.MMS available )********/
  #define IS_TIM_MASTER_INSTANCE(INSTANCE)   (((INSTANCE) == TIM1)   || \
                                              ((INSTANCE) == TIM2)   || \
                                              ((INSTANCE) == TIM3)   || \
                                              ((INSTANCE) == TIM4)   || \
                                              ((INSTANCE) == TIM5)   || \
                                              ((INSTANCE) == TIM6)   || \
                                              ((INSTANCE) == TIM7)   || \
                                              ((INSTANCE) == TIM8)   || \
                                              ((INSTANCE) == TIM12)  || \
                                              ((INSTANCE) == TIM15)  || \
                                              ((INSTANCE) == TIM23)  || \
                                              ((INSTANCE) == TIM24))
  
  /****** TIM Instances : Salve mode available (TIMx_SMCR.TS available )*********/
  #define IS_TIM_SLAVE_INSTANCE(INSTANCE)   (((INSTANCE) == TIM1)   || \
                                             ((INSTANCE) == TIM2)   || \
                                             ((INSTANCE) == TIM3)   || \
                                             ((INSTANCE) == TIM4)   || \
                                             ((INSTANCE) == TIM5)   || \
                                             ((INSTANCE) == TIM8)   || \
                                             ((INSTANCE) == TIM12)  || \
                                             ((INSTANCE) == TIM15)  || \
                                             ((INSTANCE) == TIM23)  || \
                                             ((INSTANCE) == TIM24))
  
  /****** TIM Instances : TRGO2 available (TIMx_CR2.MMS2 available )*********/
  #define IS_TIM_TRGO2_INSTANCE(INSTANCE)   (((INSTANCE) == TIM1)   || \
                                             ((INSTANCE) == TIM8))
  
  /****** TIM Instances : TISEL available (TIMx_TISEL available )*********/
  #define IS_TIM_TISEL_INSTANCE(INSTANCE)  (((INSTANCE) == TIM1)   || \
                                            ((INSTANCE) == TIM2)   || \
                                            ((INSTANCE) == TIM3)   || \
                                            ((INSTANCE) == TIM4)   || \
                                            ((INSTANCE) == TIM5)   || \
                                            ((INSTANCE) == TIM8)   || \
                                            ((INSTANCE) == TIM15)  || \
                                            ((INSTANCE) == TIM16)  || \
                                            ((INSTANCE) == TIM17)  || \
                                            ((INSTANCE) == TIM23)  || \
                                            ((INSTANCE) == TIM24))
  
  /****************** TIM Instances : supporting commutation event *************/
  #define IS_TIM_COMMUTATION_EVENT_INSTANCE(INSTANCE) (((INSTANCE) == TIM1)    || \
                                                       ((INSTANCE) == TIM8)    || \
                                                       ((INSTANCE) == TIM15)   || \
                                                       ((INSTANCE) == TIM16)   || \
                                                       ((INSTANCE) == TIM17))
  
  /****************** TIM Instances : supporting encoder interface **************/
  #define IS_TIM_ENCODER_INTERFACE_INSTANCE(__INSTANCE__)  (((__INSTANCE__) == TIM1)  || \
                                                        ((__INSTANCE__) == TIM2)      || \
                                                        ((__INSTANCE__) == TIM3)      || \
                                                        ((__INSTANCE__) == TIM4)      || \
                                                        ((__INSTANCE__) == TIM5)      || \
                                                        ((__INSTANCE__) == TIM8)      || \
                                                        ((__INSTANCE__) == TIM23)      || \
                                                        ((__INSTANCE__) == TIM24))
  
  /****** TIM Instances : TIM_CCR5_GC5C available (TIMx_CCR5.GC5C available )*********/
  #define IS_TIM_COMBINED3PHASEPWM_INSTANCE(INSTANCE)   (((INSTANCE) == TIM1)   || \
                                                         ((INSTANCE) == TIM8))
  /******************* TIM Instances : output(s) available **********************/
  #define IS_TIM_CCX_INSTANCE(INSTANCE, CHANNEL) \
      ((((INSTANCE) == TIM1) &&                  \
       (((CHANNEL) == TIM_CHANNEL_1) ||          \
        ((CHANNEL) == TIM_CHANNEL_2) ||          \
        ((CHANNEL) == TIM_CHANNEL_3) ||          \
        ((CHANNEL) == TIM_CHANNEL_4) ||          \
        ((CHANNEL) == TIM_CHANNEL_5) ||          \
        ((CHANNEL) == TIM_CHANNEL_6)))           \
       ||                                        \
       (((INSTANCE) == TIM2) &&                  \
       (((CHANNEL) == TIM_CHANNEL_1) ||          \
        ((CHANNEL) == TIM_CHANNEL_2) ||          \
        ((CHANNEL) == TIM_CHANNEL_3) ||          \
        ((CHANNEL) == TIM_CHANNEL_4)))           \
    ||                                           \
        (((INSTANCE) == TIM3) &&                 \
        (((CHANNEL) == TIM_CHANNEL_1)||          \
        ((CHANNEL) == TIM_CHANNEL_2) ||          \
        ((CHANNEL) == TIM_CHANNEL_3) ||          \
        ((CHANNEL) == TIM_CHANNEL_4)))           \
    ||                                           \
        (((INSTANCE) == TIM4) &&                 \
        (((CHANNEL) == TIM_CHANNEL_1) ||         \
        ((CHANNEL) == TIM_CHANNEL_2) ||          \
        ((CHANNEL) == TIM_CHANNEL_3) ||          \
        ((CHANNEL) == TIM_CHANNEL_4)))           \
    ||                                           \
        (((INSTANCE) == TIM5) &&                 \
        (((CHANNEL) == TIM_CHANNEL_1) ||         \
        ((CHANNEL) == TIM_CHANNEL_2) ||          \
        ((CHANNEL) == TIM_CHANNEL_3) ||          \
        ((CHANNEL) == TIM_CHANNEL_4)))           \
    ||                                           \
        (((INSTANCE) == TIM8) &&                 \
        (((CHANNEL) == TIM_CHANNEL_1) ||         \
        ((CHANNEL) == TIM_CHANNEL_2) ||          \
        ((CHANNEL) == TIM_CHANNEL_3) ||          \
        ((CHANNEL) == TIM_CHANNEL_4) ||          \
        ((CHANNEL) == TIM_CHANNEL_5) ||          \
        ((CHANNEL) == TIM_CHANNEL_6)))           \
    ||                                           \
       (((INSTANCE) == TIM12) &&                 \
       (((CHANNEL) == TIM_CHANNEL_1) ||          \
        ((CHANNEL) == TIM_CHANNEL_2)))           \
    ||                                           \
       (((INSTANCE) == TIM13) &&                 \
       (((CHANNEL) == TIM_CHANNEL_1)))           \
    ||                                           \
       (((INSTANCE) == TIM14) &&                 \
       (((CHANNEL) == TIM_CHANNEL_1)))           \
    ||                                           \
       (((INSTANCE) == TIM15) &&                 \
       (((CHANNEL) == TIM_CHANNEL_1) ||          \
       ((CHANNEL) == TIM_CHANNEL_2)))            \
    ||                                           \
       (((INSTANCE) == TIM16) &&                 \
       (((CHANNEL) == TIM_CHANNEL_1)))           \
    ||                                           \
       (((INSTANCE) == TIM17) &&                 \
       (((CHANNEL) == TIM_CHANNEL_1)))           \
       ||                                        \
       (((INSTANCE) == TIM23) &&                 \
       (((CHANNEL) == TIM_CHANNEL_1) ||          \
        ((CHANNEL) == TIM_CHANNEL_2) ||          \
        ((CHANNEL) == TIM_CHANNEL_3) ||          \
        ((CHANNEL) == TIM_CHANNEL_4)))           \
       ||                                        \
       (((INSTANCE) == TIM24) &&                 \
       (((CHANNEL) == TIM_CHANNEL_1) ||          \
        ((CHANNEL) == TIM_CHANNEL_2) ||          \
        ((CHANNEL) == TIM_CHANNEL_3) ||          \
        ((CHANNEL) == TIM_CHANNEL_4))))
  
  /****************** TIM Instances : supporting the break function *************/
  #define IS_TIM_BREAK_INSTANCE(INSTANCE)\
        (((INSTANCE) == TIM1)    || \
        ((INSTANCE) == TIM8)     || \
         ((INSTANCE) == TIM15)   || \
         ((INSTANCE) == TIM16)   || \
         ((INSTANCE) == TIM17))
  
