JPrier/LLMK/inc/system/stm32h723x.h
  /************** TIM Instances : supporting Break source selection *************/
  #define IS_TIM_BREAKSOURCE_INSTANCE(INSTANCE) (((INSTANCE) == TIM1)   || \
                                                 ((INSTANCE) == TIM8))
  
  /****************** TIM Instances : supporting complementary output(s) ********/
  #define IS_TIM_CCXN_INSTANCE(INSTANCE, CHANNEL) \
     ((((INSTANCE) == TIM1) &&                    \
       (((CHANNEL) == TIM_CHANNEL_1) ||           \
        ((CHANNEL) == TIM_CHANNEL_2) ||           \
        ((CHANNEL) == TIM_CHANNEL_3)))            \
   ||                                             \
        (((INSTANCE) == TIM8) &&                  \
        (((CHANNEL) == TIM_CHANNEL_1) ||          \
        ((CHANNEL) == TIM_CHANNEL_2) ||           \
        ((CHANNEL) == TIM_CHANNEL_3)))            \
      ||                                          \
      (((INSTANCE) == TIM15) &&                   \
        ((CHANNEL) == TIM_CHANNEL_1))             \
      ||                                          \
      (((INSTANCE) == TIM16) &&                   \
       ((CHANNEL) == TIM_CHANNEL_1))              \
      ||                                          \
      (((INSTANCE) == TIM17) &&                   \
       ((CHANNEL) == TIM_CHANNEL_1)))
  
  /****************** TIM Instances : supporting counting mode selection ********/
  #define IS_TIM_COUNTER_MODE_SELECT_INSTANCE(INSTANCE)\
    (((INSTANCE) == TIM1)    || \
     ((INSTANCE) == TIM2)    || \
     ((INSTANCE) == TIM3)    || \
     ((INSTANCE) == TIM4)    || \
     ((INSTANCE) == TIM5)    || \
     ((INSTANCE) == TIM8))
  
  /****************** TIM Instances : supporting repetition counter *************/
  #define IS_TIM_REPETITION_COUNTER_INSTANCE(INSTANCE)\
    (((INSTANCE) == TIM1)    || \
     ((INSTANCE) == TIM8)    || \
     ((INSTANCE) == TIM15)   || \
     ((INSTANCE) == TIM16)   || \
     ((INSTANCE) == TIM17))
  
  /****************** TIM Instances : supporting synchronization ****************/
  #define IS_TIM_SYNCHRO_INSTANCE(__INSTANCE__)\
      (((__INSTANCE__) == TIM1)    || \
       ((__INSTANCE__) == TIM2)    || \
       ((__INSTANCE__) == TIM3)    || \
       ((__INSTANCE__) == TIM4)    || \
       ((__INSTANCE__) == TIM5)    || \
       ((__INSTANCE__) == TIM6)    || \
       ((__INSTANCE__) == TIM8)    || \
       ((__INSTANCE__) == TIM12)   || \
       ((__INSTANCE__) == TIM15)   || \
       ((__INSTANCE__) == TIM23)   || \
       ((__INSTANCE__) == TIM24))
  
  /****************** TIM Instances : supporting clock division *****************/
  #define IS_TIM_CLOCK_DIVISION_INSTANCE(INSTANCE)\
    (((INSTANCE) == TIM1)    || \
     ((INSTANCE) == TIM2)    || \
     ((INSTANCE) == TIM3)    || \
     ((INSTANCE) == TIM4)    || \
     ((INSTANCE) == TIM5)    || \
     ((INSTANCE) == TIM8)    || \
     ((INSTANCE) == TIM15)   || \
     ((INSTANCE) == TIM16)   || \
     ((INSTANCE) == TIM17)   || \
     ((INSTANCE) == TIM23)   || \
     ((INSTANCE) == TIM24))
  
  /****************** TIM Instances : supporting external clock mode 1 for ETRF input */
  #define IS_TIM_CLOCKSOURCE_ETRMODE1_INSTANCE(INSTANCE)\
    (((INSTANCE) == TIM1)    || \
     ((INSTANCE) == TIM2)    || \
     ((INSTANCE) == TIM3)    || \
     ((INSTANCE) == TIM4)    || \
     ((INSTANCE) == TIM5)    || \
     ((INSTANCE) == TIM8)    || \
     ((INSTANCE) == TIM23)   || \
     ((INSTANCE) == TIM24))
  
  /****************** TIM Instances : supporting external clock mode 2 **********/
  #define IS_TIM_CLOCKSOURCE_ETRMODE2_INSTANCE(INSTANCE)\
   (((INSTANCE) == TIM1)     || \
     ((INSTANCE) == TIM2)    || \
     ((INSTANCE) == TIM3)    || \
     ((INSTANCE) == TIM4)    || \
     ((INSTANCE) == TIM5)    || \
     ((INSTANCE) == TIM8)    || \
     ((INSTANCE) == TIM23)   || \
     ((INSTANCE) == TIM24))
  
  /****************** TIM Instances : supporting external clock mode 1 for TIX inputs*/
  #define IS_TIM_CLOCKSOURCE_TIX_INSTANCE(INSTANCE)\
    (((INSTANCE) == TIM1)    || \
     ((INSTANCE) == TIM2)    || \
     ((INSTANCE) == TIM3)    || \
     ((INSTANCE) == TIM4)    || \
     ((INSTANCE) == TIM5)    || \
     ((INSTANCE) == TIM8)    || \
     ((INSTANCE) == TIM12)   || \
     ((INSTANCE) == TIM15)   || \
     ((INSTANCE) == TIM23)   || \
     ((INSTANCE) == TIM24))
  
  /****************** TIM Instances : supporting internal trigger inputs(ITRX) *******/
  #define IS_TIM_CLOCKSOURCE_ITRX_INSTANCE(INSTANCE)\
    (((INSTANCE) == TIM1)    || \
     ((INSTANCE) == TIM2)    || \
     ((INSTANCE) == TIM3)    || \
     ((INSTANCE) == TIM4)    || \
     ((INSTANCE) == TIM5)    || \
     ((INSTANCE) == TIM8)    || \
     ((INSTANCE) == TIM12)   || \
     ((INSTANCE) == TIM15)   || \
     ((INSTANCE) == TIM23)   || \
     ((INSTANCE) == TIM24))
  
  /****************** TIM Instances : supporting OCxREF clear *******************/
  #define IS_TIM_OCXREF_CLEAR_INSTANCE(INSTANCE)\
    (((INSTANCE) == TIM1)    || \
     ((INSTANCE) == TIM2)    || \
     ((INSTANCE) == TIM3))
  
  /****************** TIM Instances : TIM_32B_COUNTER ***************************/
  #define IS_TIM_32B_COUNTER_INSTANCE(INSTANCE)\
    (((INSTANCE) == TIM2)    || \
     ((INSTANCE) == TIM5)    || \
     ((INSTANCE) == TIM23)   || \
     ((INSTANCE) == TIM24))
  
  /****************** TIM Instances : TIM_BKIN2 ***************************/
  #define IS_TIM_BKIN2_INSTANCE(INSTANCE)\
    (((INSTANCE) == TIM1)    || \
     ((INSTANCE) == TIM8))
  
  /****************** TIM Instances : supporting Hall sensor interface **********/
  #define IS_TIM_HALL_SENSOR_INTERFACE_INSTANCE(__INSTANCE__) (((__INSTANCE__) == TIM1)  || \
                                                               ((__INSTANCE__) == TIM2)  || \
                                                               ((__INSTANCE__) == TIM3)  || \
                                                               ((__INSTANCE__) == TIM4)  || \
                                                               ((__INSTANCE__) == TIM5)  || \
                                                               ((__INSTANCE__) == TIM15) || \
                                                               ((__INSTANCE__) == TIM8)  || \
                                                               ((__INSTANCE__) == TIM23) || \
                                                               ((__INSTANCE__) == TIM24))
  
  /******************** USART Instances : Synchronous mode **********************/
  #define IS_USART_INSTANCE(INSTANCE) (((INSTANCE) == USART1) || \
                                       ((INSTANCE) == USART2) || \
                                       ((INSTANCE) == USART3) || \
                                       ((INSTANCE) == USART6) || \
                                       ((INSTANCE) == USART10))
  
  /******************** USART Instances : SPI slave mode ************************/
  #define IS_UART_SPI_SLAVE_INSTANCE(INSTANCE) (((INSTANCE) == USART1) || \
                                                ((INSTANCE) == USART2) || \
                                                ((INSTANCE) == USART3) || \
                                                ((INSTANCE) == USART6) || \
                                                ((INSTANCE) == USART10))
  
