JPrier/LLMK/inc/system/stm32h723x.h
  /******************** UART Instances : Asynchronous mode **********************/
  #define IS_UART_INSTANCE(INSTANCE) (((INSTANCE) == USART1) || \
                                      ((INSTANCE) == USART2) || \
                                      ((INSTANCE) == USART3) || \
                                      ((INSTANCE) == UART4)  || \
                                      ((INSTANCE) == UART5)  || \
                                      ((INSTANCE) == USART6) || \
                                      ((INSTANCE) == UART7)  || \
                                      ((INSTANCE) == UART8)  || \
                                      ((INSTANCE) == UART9)  || \
                                      ((INSTANCE) == USART10))
  
  /******************** UART Instances : FIFO mode.******************************/
  #define IS_UART_FIFO_INSTANCE(INSTANCE) (((INSTANCE) == USART1) || \
                                           ((INSTANCE) == USART2) || \
                                           ((INSTANCE) == USART3) || \
                                           ((INSTANCE) == UART4)  || \
                                           ((INSTANCE) == UART5)  || \
                                           ((INSTANCE) == USART6) || \
                                           ((INSTANCE) == UART7)  || \
                                           ((INSTANCE) == UART8)  || \
                                           ((INSTANCE) == UART9)  || \
                                           ((INSTANCE) == USART10)|| \
                                           ((INSTANCE) == LPUART1))
  
  /****************** UART Instances : Auto Baud Rate detection *****************/
  #define IS_USART_AUTOBAUDRATE_DETECTION_INSTANCE(INSTANCE) (((INSTANCE) == USART1) || \
                                                              ((INSTANCE) == USART2) || \
                                                              ((INSTANCE) == USART3) || \
                                                              ((INSTANCE) == UART4)  || \
                                                              ((INSTANCE) == UART5)  || \
                                                              ((INSTANCE) == USART6) || \
                                                              ((INSTANCE) == UART7)  || \
                                                              ((INSTANCE) == UART8)  || \
                                                              ((INSTANCE) == UART9)  || \
                                                              ((INSTANCE) == USART10))
  
  /*********************** UART Instances : Driver Enable ***********************/
  #define IS_UART_DRIVER_ENABLE_INSTANCE(INSTANCE) (((INSTANCE) == USART1) || \
                                                    ((INSTANCE) == USART2) || \
                                                    ((INSTANCE) == USART3) || \
                                                    ((INSTANCE) == UART4)  || \
                                                    ((INSTANCE) == UART5)  || \
                                                    ((INSTANCE) == USART6) || \
                                                    ((INSTANCE) == UART7)  || \
                                                    ((INSTANCE) == UART8)  || \
                                                    ((INSTANCE) == UART9)  || \
                                                    ((INSTANCE) == USART10)|| \
                                                    ((INSTANCE) == LPUART1))
  
  /********************* UART Instances : Half-Duplex mode **********************/
  #define IS_UART_HALFDUPLEX_INSTANCE(INSTANCE) (((INSTANCE) == USART1) || \
                                                 ((INSTANCE) == USART2) || \
                                                 ((INSTANCE) == USART3) || \
                                                 ((INSTANCE) == UART4)  || \
                                                 ((INSTANCE) == UART5)  || \
                                                 ((INSTANCE) == USART6) || \
                                                 ((INSTANCE) == UART7)  || \
                                                 ((INSTANCE) == UART8)  || \
                                                 ((INSTANCE) == UART9)  || \
                                                 ((INSTANCE) == USART10)|| \
                                                 ((INSTANCE) == LPUART1))
  
  /******************* UART Instances : Hardware Flow control *******************/
  #define IS_UART_HWFLOW_INSTANCE(INSTANCE) (((INSTANCE) == USART1) || \
                                             ((INSTANCE) == USART2) || \
                                             ((INSTANCE) == USART3) || \
                                             ((INSTANCE) == UART4)  || \
                                             ((INSTANCE) == UART5)  || \
                                             ((INSTANCE) == USART6) || \
                                             ((INSTANCE) == UART7)  || \
                                             ((INSTANCE) == UART8)  || \
                                             ((INSTANCE) == UART9)  || \
                                             ((INSTANCE) == USART10)|| \
                                             ((INSTANCE) == LPUART1))
  
  /************************* UART Instances : LIN mode **************************/
  #define IS_UART_LIN_INSTANCE(INSTANCE) (((INSTANCE) == USART1) || \
                                          ((INSTANCE) == USART2) || \
                                          ((INSTANCE) == USART3) || \
                                          ((INSTANCE) == UART4)  || \
                                          ((INSTANCE) == UART5)  || \
                                          ((INSTANCE) == USART6) || \
                                          ((INSTANCE) == UART7)  || \
                                          ((INSTANCE) == UART8)  || \
                                          ((INSTANCE) == UART9)  || \
                                          ((INSTANCE) == USART10))
  
  /****************** UART Instances : Wake-up from Stop mode *******************/
  #define IS_UART_WAKEUP_FROMSTOP_INSTANCE(INSTANCE) (((INSTANCE) == USART1) || \
                                                      ((INSTANCE) == USART2) || \
                                                      ((INSTANCE) == USART3) || \
                                                      ((INSTANCE) == UART4)  || \
                                                      ((INSTANCE) == UART5)  || \
                                                      ((INSTANCE) == USART6) || \
                                                      ((INSTANCE) == UART7)  || \
                                                      ((INSTANCE) == UART8)  || \
                                                      ((INSTANCE) == UART9)  || \
                                                      ((INSTANCE) == USART10)|| \
                                                      ((INSTANCE) == LPUART1))
  
  /************************* UART Instances : IRDA mode *************************/
  #define IS_IRDA_INSTANCE(INSTANCE) (((INSTANCE) == USART1) || \
                                      ((INSTANCE) == USART2) || \
                                      ((INSTANCE) == USART3) || \
                                      ((INSTANCE) == UART4)  || \
                                      ((INSTANCE) == UART5)  || \
                                      ((INSTANCE) == USART6) || \
                                      ((INSTANCE) == UART7)  || \
                                      ((INSTANCE) == UART8)  || \
                                      ((INSTANCE) == UART9)  || \
                                      ((INSTANCE) == USART10))
  
  /********************* USART Instances : Smard card mode **********************/
  #define IS_SMARTCARD_INSTANCE(INSTANCE) (((INSTANCE) == USART1) || \
                                           ((INSTANCE) == USART2) || \
                                           ((INSTANCE) == USART3) || \
                                           ((INSTANCE) == USART6) ||\
                                           ((INSTANCE) == USART10))
  
  /****************************** LPUART Instance *******************************/
  #define IS_LPUART_INSTANCE(INSTANCE) ((INSTANCE) == LPUART1)
  
