JPrier/LLMK/inc/system/stm32h723x.h
  /****************************** IWDG Instances ********************************/
  #define IS_IWDG_ALL_INSTANCE(INSTANCE)  ((INSTANCE) == IWDG1)
  /****************************** USB Instances ********************************/
  #define IS_USB_ALL_INSTANCE(INSTANCE) ((INSTANCE) == USB)
  
  /****************************** WWDG Instances ********************************/
  #define IS_WWDG_ALL_INSTANCE(INSTANCE)  ((INSTANCE) == WWDG1)
  /****************************** MDIOS Instances ********************************/
  #define IS_MDIOS_ALL_INSTANCE(INSTANCE)  ((INSTANCE) == MDIOS)
  
  /****************************** CEC Instances *********************************/
  #define IS_CEC_ALL_INSTANCE(__INSTANCE__) ((__INSTANCE__) == CEC)
  
  /****************************** SAI Instances ********************************/
  #define IS_SAI_ALL_INSTANCE(INSTANCE) (((INSTANCE) == SAI1_Block_A) || \
                                         ((INSTANCE) == SAI1_Block_B) || \
                                         ((INSTANCE) == SAI4_Block_A) || \
                                         ((INSTANCE) == SAI4_Block_B))
  
  /****************************** SPDIFRX Instances ********************************/
  #define IS_SPDIFRX_ALL_INSTANCE(INSTANCE) ((INSTANCE) == SPDIFRX)
  
  /****************************** OPAMP Instances *******************************/
  #define IS_OPAMP_ALL_INSTANCE(INSTANCE) (((INSTANCE) == OPAMP1) || \
                                           ((INSTANCE) == OPAMP2))
  
  #define IS_OPAMP_COMMON_INSTANCE(COMMON_INSTANCE) ((COMMON_INSTANCE) == OPAMP12_COMMON)
  
  /*********************** USB OTG PCD Instances ********************************/
  #define IS_PCD_ALL_INSTANCE(INSTANCE) ((INSTANCE) == USB_OTG_HS)
  
  /*********************** USB OTG HCD Instances ********************************/
  #define IS_HCD_ALL_INSTANCE(INSTANCE) ((INSTANCE) == USB_OTG_HS)
  
  /******************************************************************************/
  /*  For a painless codes migration between the STM32H7xx device product       */
  /*  lines, or with STM32F7xx devices the aliases defined below are put        */
  /*   in place to overcome the differences in the interrupt handlers and IRQn  */
  /*   definitions. No need to update developed interrupt code when moving      */
  /*  across product lines within the same STM32H7 Family                       */
  /******************************************************************************/
  
  /* Aliases for __IRQn */
  #define  HASH_RNG_IRQn                  RNG_IRQn
  #define  TIM1_BRK_TIM9_IRQn             TIM1_BRK_IRQn
  #define  TIM1_UP_TIM10_IRQn             TIM1_UP_IRQn
  #define  TIM1_TRG_COM_TIM11_IRQn        TIM1_TRG_COM_IRQn
  #define  PVD_IRQn                       PVD_AVD_IRQn
  
  
  /* Aliases for DCMI/PSSI __IRQn */
  #define  DCMI_IRQn                      DCMI_PSSI_IRQn
  
  /* Aliases for __IRQHandler */
  #define  HASH_RNG_IRQHandler           RNG_IRQHandler
  #define TIM1_BRK_TIM9_IRQHandler       TIM1_BRK_IRQHandler
  #define TIM1_UP_TIM9_IRQHandler        TIM1_UP_IRQHandler
  #define TIM1_TRG_COM_TIM11_IRQHandler  TIM1_TRG_COM_IRQHandler
  #define PVD_IRQHandler                 PVD_AVD_IRQHandler
  
  /* Aliases for COMP __IRQHandler */
  #define COMP_IRQHandler                COMP1_IRQHandler
  
  /**
    * @}
    */
  
  /**
    * @}
    */
  
  /**
    * @}
    */
  
  #ifdef __cplusplus
  }
  #endif /* __cplusplus */
  
  #endif /* STM32H723xx_H */
  